MikroElektronika/core_packages/PIC/XC8/def/PIC18F8585/mcu.h
extern volatile RXF9SIDHbits_t RXF9SIDHbits __at(0xD70);
// bitfield macros
#define _RXF9SIDH_SID3_POSN                                 0x0
#define _RXF9SIDH_SID3_POSITION                             0x0
#define _RXF9SIDH_SID3_SIZE                                 0x1
#define _RXF9SIDH_SID3_LENGTH                               0x1
#define _RXF9SIDH_SID3_MASK                                 0x1
#define _RXF9SIDH_SID4_POSN                                 0x1
#define _RXF9SIDH_SID4_POSITION                             0x1
#define _RXF9SIDH_SID4_SIZE                                 0x1
#define _RXF9SIDH_SID4_LENGTH                               0x1
#define _RXF9SIDH_SID4_MASK                                 0x2
#define _RXF9SIDH_SID5_POSN                                 0x2
#define _RXF9SIDH_SID5_POSITION                             0x2
#define _RXF9SIDH_SID5_SIZE                                 0x1
#define _RXF9SIDH_SID5_LENGTH                               0x1
#define _RXF9SIDH_SID5_MASK                                 0x4
#define _RXF9SIDH_SID6_POSN                                 0x3
#define _RXF9SIDH_SID6_POSITION                             0x3
#define _RXF9SIDH_SID6_SIZE                                 0x1
#define _RXF9SIDH_SID6_LENGTH                               0x1
#define _RXF9SIDH_SID6_MASK                                 0x8
#define _RXF9SIDH_SID7_POSN                                 0x4
#define _RXF9SIDH_SID7_POSITION                             0x4
#define _RXF9SIDH_SID7_SIZE                                 0x1
#define _RXF9SIDH_SID7_LENGTH                               0x1
#define _RXF9SIDH_SID7_MASK                                 0x10
#define _RXF9SIDH_SID8_POSN                                 0x5
#define _RXF9SIDH_SID8_POSITION                             0x5
#define _RXF9SIDH_SID8_SIZE                                 0x1
#define _RXF9SIDH_SID8_LENGTH                               0x1
#define _RXF9SIDH_SID8_MASK                                 0x20
#define _RXF9SIDH_SID9_POSN                                 0x6
#define _RXF9SIDH_SID9_POSITION                             0x6
#define _RXF9SIDH_SID9_SIZE                                 0x1
#define _RXF9SIDH_SID9_LENGTH                               0x1
#define _RXF9SIDH_SID9_MASK                                 0x40
#define _RXF9SIDH_SID10_POSN                                0x7
#define _RXF9SIDH_SID10_POSITION                            0x7
#define _RXF9SIDH_SID10_SIZE                                0x1
#define _RXF9SIDH_SID10_LENGTH                              0x1
#define _RXF9SIDH_SID10_MASK                                0x80
#define _RXF9SIDH_RXF9SID3_POSN                             0x0
#define _RXF9SIDH_RXF9SID3_POSITION                         0x0
#define _RXF9SIDH_RXF9SID3_SIZE                             0x1
#define _RXF9SIDH_RXF9SID3_LENGTH                           0x1
#define _RXF9SIDH_RXF9SID3_MASK                             0x1
#define _RXF9SIDH_RXF9SID4_POSN                             0x1
#define _RXF9SIDH_RXF9SID4_POSITION                         0x1
#define _RXF9SIDH_RXF9SID4_SIZE                             0x1
#define _RXF9SIDH_RXF9SID4_LENGTH                           0x1
#define _RXF9SIDH_RXF9SID4_MASK                             0x2
#define _RXF9SIDH_RXF9SID5_POSN                             0x2
#define _RXF9SIDH_RXF9SID5_POSITION                         0x2
#define _RXF9SIDH_RXF9SID5_SIZE                             0x1
#define _RXF9SIDH_RXF9SID5_LENGTH                           0x1
#define _RXF9SIDH_RXF9SID5_MASK                             0x4
#define _RXF9SIDH_RXF9SID6_POSN                             0x3
#define _RXF9SIDH_RXF9SID6_POSITION                         0x3
#define _RXF9SIDH_RXF9SID6_SIZE                             0x1
#define _RXF9SIDH_RXF9SID6_LENGTH                           0x1
#define _RXF9SIDH_RXF9SID6_MASK                             0x8
#define _RXF9SIDH_RXF9SID7_POSN                             0x4
#define _RXF9SIDH_RXF9SID7_POSITION                         0x4
#define _RXF9SIDH_RXF9SID7_SIZE                             0x1
#define _RXF9SIDH_RXF9SID7_LENGTH                           0x1
#define _RXF9SIDH_RXF9SID7_MASK                             0x10
#define _RXF9SIDH_RXF9SID8_POSN                             0x5
#define _RXF9SIDH_RXF9SID8_POSITION                         0x5
#define _RXF9SIDH_RXF9SID8_SIZE                             0x1
#define _RXF9SIDH_RXF9SID8_LENGTH                           0x1
#define _RXF9SIDH_RXF9SID8_MASK                             0x20
#define _RXF9SIDH_RXF9SID9_POSN                             0x6
#define _RXF9SIDH_RXF9SID9_POSITION                         0x6
#define _RXF9SIDH_RXF9SID9_SIZE                             0x1
#define _RXF9SIDH_RXF9SID9_LENGTH                           0x1
#define _RXF9SIDH_RXF9SID9_MASK                             0x40
#define _RXF9SIDH_RXF9SID10_POSN                            0x7
#define _RXF9SIDH_RXF9SID10_POSITION                        0x7
#define _RXF9SIDH_RXF9SID10_SIZE                            0x1
#define _RXF9SIDH_RXF9SID10_LENGTH                          0x1
#define _RXF9SIDH_RXF9SID10_MASK                            0x80

// Register: RXF9SIDL
#define RXF9SIDL RXF9SIDL
extern volatile unsigned char           RXF9SIDL            __at(0xD71);
#ifndef _LIB_BUILD
asm("RXF9SIDL equ 0D71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXIDE                  :1;
    };
    struct {
        unsigned RXF9EID16              :1;
        unsigned RXF9EID17              :1;
        unsigned                        :1;
        unsigned RXF9EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF9SID0               :1;
        unsigned RXF9SID1               :1;
        unsigned RXF9SID2               :1;
    };
} RXF9SIDLbits_t;
extern volatile RXF9SIDLbits_t RXF9SIDLbits __at(0xD71);
// bitfield macros
#define _RXF9SIDL_EID16_POSN                                0x0
#define _RXF9SIDL_EID16_POSITION                            0x0
#define _RXF9SIDL_EID16_SIZE                                0x1
#define _RXF9SIDL_EID16_LENGTH                              0x1
#define _RXF9SIDL_EID16_MASK                                0x1
#define _RXF9SIDL_EID17_POSN                                0x1
#define _RXF9SIDL_EID17_POSITION                            0x1
#define _RXF9SIDL_EID17_SIZE                                0x1
#define _RXF9SIDL_EID17_LENGTH                              0x1
#define _RXF9SIDL_EID17_MASK                                0x2
#define _RXF9SIDL_EXIDEN_POSN                               0x3
#define _RXF9SIDL_EXIDEN_POSITION                           0x3
#define _RXF9SIDL_EXIDEN_SIZE                               0x1
#define _RXF9SIDL_EXIDEN_LENGTH                             0x1
#define _RXF9SIDL_EXIDEN_MASK                               0x8
#define _RXF9SIDL_SID0_POSN                                 0x5
#define _RXF9SIDL_SID0_POSITION                             0x5
#define _RXF9SIDL_SID0_SIZE                                 0x1
#define _RXF9SIDL_SID0_LENGTH                               0x1
#define _RXF9SIDL_SID0_MASK                                 0x20
#define _RXF9SIDL_SID1_POSN                                 0x6
#define _RXF9SIDL_SID1_POSITION                             0x6
#define _RXF9SIDL_SID1_SIZE                                 0x1
#define _RXF9SIDL_SID1_LENGTH                               0x1
#define _RXF9SIDL_SID1_MASK                                 0x40
#define _RXF9SIDL_SID2_POSN                                 0x7
#define _RXF9SIDL_SID2_POSITION                             0x7
#define _RXF9SIDL_SID2_SIZE                                 0x1
#define _RXF9SIDL_SID2_LENGTH                               0x1
#define _RXF9SIDL_SID2_MASK                                 0x80
#define _RXF9SIDL_EXIDE_POSN                                0x3
#define _RXF9SIDL_EXIDE_POSITION                            0x3
#define _RXF9SIDL_EXIDE_SIZE                                0x1
#define _RXF9SIDL_EXIDE_LENGTH                              0x1
#define _RXF9SIDL_EXIDE_MASK                                0x8
#define _RXF9SIDL_RXF9EID16_POSN                            0x0
#define _RXF9SIDL_RXF9EID16_POSITION                        0x0
#define _RXF9SIDL_RXF9EID16_SIZE                            0x1
#define _RXF9SIDL_RXF9EID16_LENGTH                          0x1
#define _RXF9SIDL_RXF9EID16_MASK                            0x1
#define _RXF9SIDL_RXF9EID17_POSN                            0x1
#define _RXF9SIDL_RXF9EID17_POSITION                        0x1
#define _RXF9SIDL_RXF9EID17_SIZE                            0x1
#define _RXF9SIDL_RXF9EID17_LENGTH                          0x1
#define _RXF9SIDL_RXF9EID17_MASK                            0x2
#define _RXF9SIDL_RXF9EXIDEN_POSN                           0x3
#define _RXF9SIDL_RXF9EXIDEN_POSITION                       0x3
#define _RXF9SIDL_RXF9EXIDEN_SIZE                           0x1
#define _RXF9SIDL_RXF9EXIDEN_LENGTH                         0x1
#define _RXF9SIDL_RXF9EXIDEN_MASK                           0x8
#define _RXF9SIDL_RXF9SID0_POSN                             0x5
#define _RXF9SIDL_RXF9SID0_POSITION                         0x5
#define _RXF9SIDL_RXF9SID0_SIZE                             0x1
#define _RXF9SIDL_RXF9SID0_LENGTH                           0x1
#define _RXF9SIDL_RXF9SID0_MASK                             0x20
#define _RXF9SIDL_RXF9SID1_POSN                             0x6
#define _RXF9SIDL_RXF9SID1_POSITION                         0x6
#define _RXF9SIDL_RXF9SID1_SIZE                             0x1
#define _RXF9SIDL_RXF9SID1_LENGTH                           0x1
#define _RXF9SIDL_RXF9SID1_MASK                             0x40
#define _RXF9SIDL_RXF9SID2_POSN                             0x7
#define _RXF9SIDL_RXF9SID2_POSITION                         0x7
#define _RXF9SIDL_RXF9SID2_SIZE                             0x1
#define _RXF9SIDL_RXF9SID2_LENGTH                           0x1
#define _RXF9SIDL_RXF9SID2_MASK                             0x80

// Register: RXF9EIDH
#define RXF9EIDH RXF9EIDH
extern volatile unsigned char           RXF9EIDH            __at(0xD72);
#ifndef _LIB_BUILD
asm("RXF9EIDH equ 0D72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF9EID8               :1;
        unsigned RXF9EID9               :1;
        unsigned RXF9EID10              :1;
        unsigned RXF9EID11              :1;
        unsigned RXF9EID12              :1;
        unsigned RXF9EID13              :1;
        unsigned RXF9EID14              :1;
        unsigned RXF9EID15              :1;
    };
} RXF9EIDHbits_t;
