MikroElektronika/core_packages/PIC/XC8/def/PIC18F8585/mcu.h
// Register: RXF14SIDL
#define RXF14SIDL RXF14SIDL
extern volatile unsigned char           RXF14SIDL           __at(0xD89);
#ifndef _LIB_BUILD
asm("RXF14SIDL equ 0D89h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXIDE                  :1;
    };
    struct {
        unsigned RXF14EID16             :1;
        unsigned RXF14EID17             :1;
        unsigned                        :1;
        unsigned RXF14EXIDEN            :1;
        unsigned                        :1;
        unsigned RXF14SID0              :1;
        unsigned RXF14SID1              :1;
        unsigned RXF14SID2              :1;
    };
} RXF14SIDLbits_t;
extern volatile RXF14SIDLbits_t RXF14SIDLbits __at(0xD89);
// bitfield macros
#define _RXF14SIDL_EID16_POSN                               0x0
#define _RXF14SIDL_EID16_POSITION                           0x0
#define _RXF14SIDL_EID16_SIZE                               0x1
#define _RXF14SIDL_EID16_LENGTH                             0x1
#define _RXF14SIDL_EID16_MASK                               0x1
#define _RXF14SIDL_EID17_POSN                               0x1
#define _RXF14SIDL_EID17_POSITION                           0x1
#define _RXF14SIDL_EID17_SIZE                               0x1
#define _RXF14SIDL_EID17_LENGTH                             0x1
#define _RXF14SIDL_EID17_MASK                               0x2
#define _RXF14SIDL_EXIDEN_POSN                              0x3
#define _RXF14SIDL_EXIDEN_POSITION                          0x3
#define _RXF14SIDL_EXIDEN_SIZE                              0x1
#define _RXF14SIDL_EXIDEN_LENGTH                            0x1
#define _RXF14SIDL_EXIDEN_MASK                              0x8
#define _RXF14SIDL_SID0_POSN                                0x5
#define _RXF14SIDL_SID0_POSITION                            0x5
#define _RXF14SIDL_SID0_SIZE                                0x1
#define _RXF14SIDL_SID0_LENGTH                              0x1
#define _RXF14SIDL_SID0_MASK                                0x20
#define _RXF14SIDL_SID1_POSN                                0x6
#define _RXF14SIDL_SID1_POSITION                            0x6
#define _RXF14SIDL_SID1_SIZE                                0x1
#define _RXF14SIDL_SID1_LENGTH                              0x1
#define _RXF14SIDL_SID1_MASK                                0x40
#define _RXF14SIDL_SID2_POSN                                0x7
#define _RXF14SIDL_SID2_POSITION                            0x7
#define _RXF14SIDL_SID2_SIZE                                0x1
#define _RXF14SIDL_SID2_LENGTH                              0x1
#define _RXF14SIDL_SID2_MASK                                0x80
#define _RXF14SIDL_EXIDE_POSN                               0x3
#define _RXF14SIDL_EXIDE_POSITION                           0x3
#define _RXF14SIDL_EXIDE_SIZE                               0x1
#define _RXF14SIDL_EXIDE_LENGTH                             0x1
#define _RXF14SIDL_EXIDE_MASK                               0x8
#define _RXF14SIDL_RXF14EID16_POSN                          0x0
#define _RXF14SIDL_RXF14EID16_POSITION                      0x0
#define _RXF14SIDL_RXF14EID16_SIZE                          0x1
#define _RXF14SIDL_RXF14EID16_LENGTH                        0x1
#define _RXF14SIDL_RXF14EID16_MASK                          0x1
#define _RXF14SIDL_RXF14EID17_POSN                          0x1
#define _RXF14SIDL_RXF14EID17_POSITION                      0x1
#define _RXF14SIDL_RXF14EID17_SIZE                          0x1
#define _RXF14SIDL_RXF14EID17_LENGTH                        0x1
#define _RXF14SIDL_RXF14EID17_MASK                          0x2
#define _RXF14SIDL_RXF14EXIDEN_POSN                         0x3
#define _RXF14SIDL_RXF14EXIDEN_POSITION                     0x3
#define _RXF14SIDL_RXF14EXIDEN_SIZE                         0x1
#define _RXF14SIDL_RXF14EXIDEN_LENGTH                       0x1
#define _RXF14SIDL_RXF14EXIDEN_MASK                         0x8
#define _RXF14SIDL_RXF14SID0_POSN                           0x5
#define _RXF14SIDL_RXF14SID0_POSITION                       0x5
#define _RXF14SIDL_RXF14SID0_SIZE                           0x1
#define _RXF14SIDL_RXF14SID0_LENGTH                         0x1
#define _RXF14SIDL_RXF14SID0_MASK                           0x20
#define _RXF14SIDL_RXF14SID1_POSN                           0x6
#define _RXF14SIDL_RXF14SID1_POSITION                       0x6
#define _RXF14SIDL_RXF14SID1_SIZE                           0x1
#define _RXF14SIDL_RXF14SID1_LENGTH                         0x1
#define _RXF14SIDL_RXF14SID1_MASK                           0x40
#define _RXF14SIDL_RXF14SID2_POSN                           0x7
#define _RXF14SIDL_RXF14SID2_POSITION                       0x7
#define _RXF14SIDL_RXF14SID2_SIZE                           0x1
#define _RXF14SIDL_RXF14SID2_LENGTH                         0x1
#define _RXF14SIDL_RXF14SID2_MASK                           0x80

// Register: RXF14EIDH
#define RXF14EIDH RXF14EIDH
extern volatile unsigned char           RXF14EIDH           __at(0xD8A);
#ifndef _LIB_BUILD
asm("RXF14EIDH equ 0D8Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF14EID8              :1;
        unsigned RXF14EID9              :1;
        unsigned RXF14EID10             :1;
        unsigned RXF14EID11             :1;
        unsigned RXF14EID12             :1;
        unsigned RXF14EID13             :1;
        unsigned RXF14EID14             :1;
        unsigned RXF14EID15             :1;
    };
} RXF14EIDHbits_t;
extern volatile RXF14EIDHbits_t RXF14EIDHbits __at(0xD8A);
// bitfield macros
#define _RXF14EIDH_EID8_POSN                                0x0
#define _RXF14EIDH_EID8_POSITION                            0x0
#define _RXF14EIDH_EID8_SIZE                                0x1
#define _RXF14EIDH_EID8_LENGTH                              0x1
#define _RXF14EIDH_EID8_MASK                                0x1
#define _RXF14EIDH_EID9_POSN                                0x1
#define _RXF14EIDH_EID9_POSITION                            0x1
#define _RXF14EIDH_EID9_SIZE                                0x1
#define _RXF14EIDH_EID9_LENGTH                              0x1
#define _RXF14EIDH_EID9_MASK                                0x2
#define _RXF14EIDH_EID10_POSN                               0x2
#define _RXF14EIDH_EID10_POSITION                           0x2
#define _RXF14EIDH_EID10_SIZE                               0x1
#define _RXF14EIDH_EID10_LENGTH                             0x1
#define _RXF14EIDH_EID10_MASK                               0x4
#define _RXF14EIDH_EID11_POSN                               0x3
#define _RXF14EIDH_EID11_POSITION                           0x3
#define _RXF14EIDH_EID11_SIZE                               0x1
#define _RXF14EIDH_EID11_LENGTH                             0x1
#define _RXF14EIDH_EID11_MASK                               0x8
#define _RXF14EIDH_EID12_POSN                               0x4
#define _RXF14EIDH_EID12_POSITION                           0x4
#define _RXF14EIDH_EID12_SIZE                               0x1
#define _RXF14EIDH_EID12_LENGTH                             0x1
#define _RXF14EIDH_EID12_MASK                               0x10
#define _RXF14EIDH_EID13_POSN                               0x5
#define _RXF14EIDH_EID13_POSITION                           0x5
#define _RXF14EIDH_EID13_SIZE                               0x1
#define _RXF14EIDH_EID13_LENGTH                             0x1
#define _RXF14EIDH_EID13_MASK                               0x20
#define _RXF14EIDH_EID14_POSN                               0x6
#define _RXF14EIDH_EID14_POSITION                           0x6
#define _RXF14EIDH_EID14_SIZE                               0x1
#define _RXF14EIDH_EID14_LENGTH                             0x1
#define _RXF14EIDH_EID14_MASK                               0x40
#define _RXF14EIDH_EID15_POSN                               0x7
#define _RXF14EIDH_EID15_POSITION                           0x7
#define _RXF14EIDH_EID15_SIZE                               0x1
#define _RXF14EIDH_EID15_LENGTH                             0x1
#define _RXF14EIDH_EID15_MASK                               0x80
#define _RXF14EIDH_RXF14EID8_POSN                           0x0
#define _RXF14EIDH_RXF14EID8_POSITION                       0x0
#define _RXF14EIDH_RXF14EID8_SIZE                           0x1
#define _RXF14EIDH_RXF14EID8_LENGTH                         0x1
#define _RXF14EIDH_RXF14EID8_MASK                           0x1
#define _RXF14EIDH_RXF14EID9_POSN                           0x1
#define _RXF14EIDH_RXF14EID9_POSITION                       0x1
#define _RXF14EIDH_RXF14EID9_SIZE                           0x1
#define _RXF14EIDH_RXF14EID9_LENGTH                         0x1
#define _RXF14EIDH_RXF14EID9_MASK                           0x2
#define _RXF14EIDH_RXF14EID10_POSN                          0x2
#define _RXF14EIDH_RXF14EID10_POSITION                      0x2
#define _RXF14EIDH_RXF14EID10_SIZE                          0x1
#define _RXF14EIDH_RXF14EID10_LENGTH                        0x1
#define _RXF14EIDH_RXF14EID10_MASK                          0x4
#define _RXF14EIDH_RXF14EID11_POSN                          0x3
#define _RXF14EIDH_RXF14EID11_POSITION                      0x3
#define _RXF14EIDH_RXF14EID11_SIZE                          0x1
#define _RXF14EIDH_RXF14EID11_LENGTH                        0x1
#define _RXF14EIDH_RXF14EID11_MASK                          0x8
#define _RXF14EIDH_RXF14EID12_POSN                          0x4
#define _RXF14EIDH_RXF14EID12_POSITION                      0x4
#define _RXF14EIDH_RXF14EID12_SIZE                          0x1
#define _RXF14EIDH_RXF14EID12_LENGTH                        0x1
#define _RXF14EIDH_RXF14EID12_MASK                          0x10
#define _RXF14EIDH_RXF14EID13_POSN                          0x5
#define _RXF14EIDH_RXF14EID13_POSITION                      0x5
#define _RXF14EIDH_RXF14EID13_SIZE                          0x1
#define _RXF14EIDH_RXF14EID13_LENGTH                        0x1
#define _RXF14EIDH_RXF14EID13_MASK                          0x20
#define _RXF14EIDH_RXF14EID14_POSN                          0x6
#define _RXF14EIDH_RXF14EID14_POSITION                      0x6
#define _RXF14EIDH_RXF14EID14_SIZE                          0x1
#define _RXF14EIDH_RXF14EID14_LENGTH                        0x1
#define _RXF14EIDH_RXF14EID14_MASK                          0x40
#define _RXF14EIDH_RXF14EID15_POSN                          0x7
#define _RXF14EIDH_RXF14EID15_POSITION                      0x7
#define _RXF14EIDH_RXF14EID15_SIZE                          0x1
#define _RXF14EIDH_RXF14EID15_LENGTH                        0x1
#define _RXF14EIDH_RXF14EID15_MASK                          0x80

// Register: RXF14EIDL
#define RXF14EIDL RXF14EIDL
extern volatile unsigned char           RXF14EIDL           __at(0xD8B);
#ifndef _LIB_BUILD
asm("RXF14EIDL equ 0D8Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF14EID0              :1;
        unsigned RXF14EID1              :1;
        unsigned RXF14EID2              :1;
        unsigned RXF14EID3              :1;
        unsigned RXF14EID4              :1;
        unsigned RXF14EID5              :1;
        unsigned RXF14EID6              :1;
        unsigned RXF14EID7              :1;
    };
} RXF14EIDLbits_t;
extern volatile RXF14EIDLbits_t RXF14EIDLbits __at(0xD8B);
// bitfield macros
#define _RXF14EIDL_EID0_POSN                                0x0
#define _RXF14EIDL_EID0_POSITION                            0x0
#define _RXF14EIDL_EID0_SIZE                                0x1
#define _RXF14EIDL_EID0_LENGTH                              0x1
#define _RXF14EIDL_EID0_MASK                                0x1
#define _RXF14EIDL_EID1_POSN                                0x1
#define _RXF14EIDL_EID1_POSITION                            0x1
#define _RXF14EIDL_EID1_SIZE                                0x1
#define _RXF14EIDL_EID1_LENGTH                              0x1
#define _RXF14EIDL_EID1_MASK                                0x2
#define _RXF14EIDL_EID2_POSN                                0x2
#define _RXF14EIDL_EID2_POSITION                            0x2
#define _RXF14EIDL_EID2_SIZE                                0x1
#define _RXF14EIDL_EID2_LENGTH                              0x1
#define _RXF14EIDL_EID2_MASK                                0x4
#define _RXF14EIDL_EID3_POSN                                0x3
#define _RXF14EIDL_EID3_POSITION                            0x3
#define _RXF14EIDL_EID3_SIZE                                0x1
#define _RXF14EIDL_EID3_LENGTH                              0x1
#define _RXF14EIDL_EID3_MASK                                0x8
#define _RXF14EIDL_EID4_POSN                                0x4
#define _RXF14EIDL_EID4_POSITION                            0x4
#define _RXF14EIDL_EID4_SIZE                                0x1
#define _RXF14EIDL_EID4_LENGTH                              0x1
#define _RXF14EIDL_EID4_MASK                                0x10
#define _RXF14EIDL_EID5_POSN                                0x5
#define _RXF14EIDL_EID5_POSITION                            0x5
#define _RXF14EIDL_EID5_SIZE                                0x1
#define _RXF14EIDL_EID5_LENGTH                              0x1
#define _RXF14EIDL_EID5_MASK                                0x20
#define _RXF14EIDL_EID6_POSN                                0x6
#define _RXF14EIDL_EID6_POSITION                            0x6
#define _RXF14EIDL_EID6_SIZE                                0x1
#define _RXF14EIDL_EID6_LENGTH                              0x1
#define _RXF14EIDL_EID6_MASK                                0x40
#define _RXF14EIDL_EID7_POSN                                0x7
#define _RXF14EIDL_EID7_POSITION                            0x7
#define _RXF14EIDL_EID7_SIZE                                0x1
#define _RXF14EIDL_EID7_LENGTH                              0x1
#define _RXF14EIDL_EID7_MASK                                0x80
#define _RXF14EIDL_RXF14EID0_POSN                           0x0
#define _RXF14EIDL_RXF14EID0_POSITION                       0x0
#define _RXF14EIDL_RXF14EID0_SIZE                           0x1
#define _RXF14EIDL_RXF14EID0_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID0_MASK                           0x1
#define _RXF14EIDL_RXF14EID1_POSN                           0x1
#define _RXF14EIDL_RXF14EID1_POSITION                       0x1
#define _RXF14EIDL_RXF14EID1_SIZE                           0x1
#define _RXF14EIDL_RXF14EID1_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID1_MASK                           0x2
#define _RXF14EIDL_RXF14EID2_POSN                           0x2
#define _RXF14EIDL_RXF14EID2_POSITION                       0x2
#define _RXF14EIDL_RXF14EID2_SIZE                           0x1
#define _RXF14EIDL_RXF14EID2_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID2_MASK                           0x4
#define _RXF14EIDL_RXF14EID3_POSN                           0x3
#define _RXF14EIDL_RXF14EID3_POSITION                       0x3
#define _RXF14EIDL_RXF14EID3_SIZE                           0x1
#define _RXF14EIDL_RXF14EID3_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID3_MASK                           0x8
#define _RXF14EIDL_RXF14EID4_POSN                           0x4
#define _RXF14EIDL_RXF14EID4_POSITION                       0x4
#define _RXF14EIDL_RXF14EID4_SIZE                           0x1
#define _RXF14EIDL_RXF14EID4_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID4_MASK                           0x10
#define _RXF14EIDL_RXF14EID5_POSN                           0x5
#define _RXF14EIDL_RXF14EID5_POSITION                       0x5
#define _RXF14EIDL_RXF14EID5_SIZE                           0x1
#define _RXF14EIDL_RXF14EID5_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID5_MASK                           0x20
#define _RXF14EIDL_RXF14EID6_POSN                           0x6
#define _RXF14EIDL_RXF14EID6_POSITION                       0x6
#define _RXF14EIDL_RXF14EID6_SIZE                           0x1
#define _RXF14EIDL_RXF14EID6_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID6_MASK                           0x40
#define _RXF14EIDL_RXF14EID7_POSN                           0x7
#define _RXF14EIDL_RXF14EID7_POSITION                       0x7
#define _RXF14EIDL_RXF14EID7_SIZE                           0x1
#define _RXF14EIDL_RXF14EID7_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID7_MASK                           0x80

// Register: RXF15SIDH
#define RXF15SIDH RXF15SIDH
extern volatile unsigned char           RXF15SIDH           __at(0xD90);
#ifndef _LIB_BUILD
asm("RXF15SIDH equ 0D90h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF15SID3              :1;
        unsigned RXF15SID4              :1;
        unsigned RXF15SID5              :1;
        unsigned RXF15SID6              :1;
        unsigned RXF15SID7              :1;
        unsigned RXF15SID8              :1;
        unsigned RXF15SID9              :1;
        unsigned RXF15SID10             :1;
    };
} RXF15SIDHbits_t;
extern volatile RXF15SIDHbits_t RXF15SIDHbits __at(0xD90);
// bitfield macros
#define _RXF15SIDH_SID3_POSN                                0x0
#define _RXF15SIDH_SID3_POSITION                            0x0
#define _RXF15SIDH_SID3_SIZE                                0x1
#define _RXF15SIDH_SID3_LENGTH                              0x1
#define _RXF15SIDH_SID3_MASK                                0x1
#define _RXF15SIDH_SID4_POSN                                0x1
#define _RXF15SIDH_SID4_POSITION                            0x1
#define _RXF15SIDH_SID4_SIZE                                0x1
#define _RXF15SIDH_SID4_LENGTH                              0x1
#define _RXF15SIDH_SID4_MASK                                0x2
#define _RXF15SIDH_SID5_POSN                                0x2
#define _RXF15SIDH_SID5_POSITION                            0x2
#define _RXF15SIDH_SID5_SIZE                                0x1
#define _RXF15SIDH_SID5_LENGTH                              0x1
#define _RXF15SIDH_SID5_MASK                                0x4
#define _RXF15SIDH_SID6_POSN                                0x3
#define _RXF15SIDH_SID6_POSITION                            0x3
#define _RXF15SIDH_SID6_SIZE                                0x1
#define _RXF15SIDH_SID6_LENGTH                              0x1
#define _RXF15SIDH_SID6_MASK                                0x8
#define _RXF15SIDH_SID7_POSN                                0x4
#define _RXF15SIDH_SID7_POSITION                            0x4
#define _RXF15SIDH_SID7_SIZE                                0x1
#define _RXF15SIDH_SID7_LENGTH                              0x1
#define _RXF15SIDH_SID7_MASK                                0x10
#define _RXF15SIDH_SID8_POSN                                0x5
#define _RXF15SIDH_SID8_POSITION                            0x5
#define _RXF15SIDH_SID8_SIZE                                0x1
#define _RXF15SIDH_SID8_LENGTH                              0x1
#define _RXF15SIDH_SID8_MASK                                0x20
#define _RXF15SIDH_SID9_POSN                                0x6
#define _RXF15SIDH_SID9_POSITION                            0x6
#define _RXF15SIDH_SID9_SIZE                                0x1
#define _RXF15SIDH_SID9_LENGTH                              0x1
#define _RXF15SIDH_SID9_MASK                                0x40
#define _RXF15SIDH_SID10_POSN                               0x7
#define _RXF15SIDH_SID10_POSITION                           0x7
#define _RXF15SIDH_SID10_SIZE                               0x1
#define _RXF15SIDH_SID10_LENGTH                             0x1
#define _RXF15SIDH_SID10_MASK                               0x80
#define _RXF15SIDH_RXF15SID3_POSN                           0x0
#define _RXF15SIDH_RXF15SID3_POSITION                       0x0
#define _RXF15SIDH_RXF15SID3_SIZE                           0x1
#define _RXF15SIDH_RXF15SID3_LENGTH                         0x1
#define _RXF15SIDH_RXF15SID3_MASK                           0x1
#define _RXF15SIDH_RXF15SID4_POSN                           0x1
#define _RXF15SIDH_RXF15SID4_POSITION                       0x1
#define _RXF15SIDH_RXF15SID4_SIZE                           0x1
#define _RXF15SIDH_RXF15SID4_LENGTH                         0x1
#define _RXF15SIDH_RXF15SID4_MASK                           0x2
#define _RXF15SIDH_RXF15SID5_POSN                           0x2
#define _RXF15SIDH_RXF15SID5_POSITION                       0x2
#define _RXF15SIDH_RXF15SID5_SIZE                           0x1
#define _RXF15SIDH_RXF15SID5_LENGTH                         0x1
#define _RXF15SIDH_RXF15SID5_MASK                           0x4
#define _RXF15SIDH_RXF15SID6_POSN                           0x3
#define _RXF15SIDH_RXF15SID6_POSITION                       0x3
#define _RXF15SIDH_RXF15SID6_SIZE                           0x1
#define _RXF15SIDH_RXF15SID6_LENGTH                         0x1
#define _RXF15SIDH_RXF15SID6_MASK                           0x8
#define _RXF15SIDH_RXF15SID7_POSN                           0x4
#define _RXF15SIDH_RXF15SID7_POSITION                       0x4
#define _RXF15SIDH_RXF15SID7_SIZE                           0x1
#define _RXF15SIDH_RXF15SID7_LENGTH                         0x1
#define _RXF15SIDH_RXF15SID7_MASK                           0x10
#define _RXF15SIDH_RXF15SID8_POSN                           0x5
#define _RXF15SIDH_RXF15SID8_POSITION                       0x5
#define _RXF15SIDH_RXF15SID8_SIZE                           0x1
#define _RXF15SIDH_RXF15SID8_LENGTH                         0x1
#define _RXF15SIDH_RXF15SID8_MASK                           0x20
#define _RXF15SIDH_RXF15SID9_POSN                           0x6
#define _RXF15SIDH_RXF15SID9_POSITION                       0x6
#define _RXF15SIDH_RXF15SID9_SIZE                           0x1
#define _RXF15SIDH_RXF15SID9_LENGTH                         0x1
#define _RXF15SIDH_RXF15SID9_MASK                           0x40
#define _RXF15SIDH_RXF15SID10_POSN                          0x7
#define _RXF15SIDH_RXF15SID10_POSITION                      0x7
#define _RXF15SIDH_RXF15SID10_SIZE                          0x1
#define _RXF15SIDH_RXF15SID10_LENGTH                        0x1
#define _RXF15SIDH_RXF15SID10_MASK                          0x80

