MikroElektronika/core_packages/PIC/XC8/def/PIC18F8585/mcu.h
// Register: B3SIDL
#define B3SIDL B3SIDL
extern volatile unsigned char           B3SIDL              __at(0xE52);
#ifndef _LIB_BUILD
asm("B3SIDL equ 0E52h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXID                   :1;
        unsigned SRR                    :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXIDE                  :1;
    };
    struct {
        unsigned B3EID16                :1;
        unsigned B3EID17                :1;
        unsigned                        :1;
        unsigned B3EXID                 :1;
        unsigned B3SRR                  :1;
        unsigned B3SID0                 :1;
        unsigned B3SID1                 :1;
        unsigned B3SID2                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned B3EXIDE                :1;
    };
} B3SIDLbits_t;
extern volatile B3SIDLbits_t B3SIDLbits __at(0xE52);
// bitfield macros
#define _B3SIDL_EID16_POSN                                  0x0
#define _B3SIDL_EID16_POSITION                              0x0
#define _B3SIDL_EID16_SIZE                                  0x1
#define _B3SIDL_EID16_LENGTH                                0x1
#define _B3SIDL_EID16_MASK                                  0x1
#define _B3SIDL_EID17_POSN                                  0x1
#define _B3SIDL_EID17_POSITION                              0x1
#define _B3SIDL_EID17_SIZE                                  0x1
#define _B3SIDL_EID17_LENGTH                                0x1
#define _B3SIDL_EID17_MASK                                  0x2
#define _B3SIDL_EXID_POSN                                   0x3
#define _B3SIDL_EXID_POSITION                               0x3
#define _B3SIDL_EXID_SIZE                                   0x1
#define _B3SIDL_EXID_LENGTH                                 0x1
#define _B3SIDL_EXID_MASK                                   0x8
#define _B3SIDL_SRR_POSN                                    0x4
#define _B3SIDL_SRR_POSITION                                0x4
#define _B3SIDL_SRR_SIZE                                    0x1
#define _B3SIDL_SRR_LENGTH                                  0x1
#define _B3SIDL_SRR_MASK                                    0x10
#define _B3SIDL_SID0_POSN                                   0x5
#define _B3SIDL_SID0_POSITION                               0x5
#define _B3SIDL_SID0_SIZE                                   0x1
#define _B3SIDL_SID0_LENGTH                                 0x1
#define _B3SIDL_SID0_MASK                                   0x20
#define _B3SIDL_SID1_POSN                                   0x6
#define _B3SIDL_SID1_POSITION                               0x6
#define _B3SIDL_SID1_SIZE                                   0x1
#define _B3SIDL_SID1_LENGTH                                 0x1
#define _B3SIDL_SID1_MASK                                   0x40
#define _B3SIDL_SID2_POSN                                   0x7
#define _B3SIDL_SID2_POSITION                               0x7
#define _B3SIDL_SID2_SIZE                                   0x1
#define _B3SIDL_SID2_LENGTH                                 0x1
#define _B3SIDL_SID2_MASK                                   0x80
#define _B3SIDL_EXIDE_POSN                                  0x3
#define _B3SIDL_EXIDE_POSITION                              0x3
#define _B3SIDL_EXIDE_SIZE                                  0x1
#define _B3SIDL_EXIDE_LENGTH                                0x1
#define _B3SIDL_EXIDE_MASK                                  0x8
#define _B3SIDL_B3EID16_POSN                                0x0
#define _B3SIDL_B3EID16_POSITION                            0x0
#define _B3SIDL_B3EID16_SIZE                                0x1
#define _B3SIDL_B3EID16_LENGTH                              0x1
#define _B3SIDL_B3EID16_MASK                                0x1
#define _B3SIDL_B3EID17_POSN                                0x1
#define _B3SIDL_B3EID17_POSITION                            0x1
#define _B3SIDL_B3EID17_SIZE                                0x1
#define _B3SIDL_B3EID17_LENGTH                              0x1
#define _B3SIDL_B3EID17_MASK                                0x2
#define _B3SIDL_B3EXID_POSN                                 0x3
#define _B3SIDL_B3EXID_POSITION                             0x3
#define _B3SIDL_B3EXID_SIZE                                 0x1
#define _B3SIDL_B3EXID_LENGTH                               0x1
#define _B3SIDL_B3EXID_MASK                                 0x8
#define _B3SIDL_B3SRR_POSN                                  0x4
#define _B3SIDL_B3SRR_POSITION                              0x4
#define _B3SIDL_B3SRR_SIZE                                  0x1
#define _B3SIDL_B3SRR_LENGTH                                0x1
#define _B3SIDL_B3SRR_MASK                                  0x10
#define _B3SIDL_B3SID0_POSN                                 0x5
#define _B3SIDL_B3SID0_POSITION                             0x5
#define _B3SIDL_B3SID0_SIZE                                 0x1
#define _B3SIDL_B3SID0_LENGTH                               0x1
#define _B3SIDL_B3SID0_MASK                                 0x20
#define _B3SIDL_B3SID1_POSN                                 0x6
#define _B3SIDL_B3SID1_POSITION                             0x6
#define _B3SIDL_B3SID1_SIZE                                 0x1
#define _B3SIDL_B3SID1_LENGTH                               0x1
#define _B3SIDL_B3SID1_MASK                                 0x40
#define _B3SIDL_B3SID2_POSN                                 0x7
#define _B3SIDL_B3SID2_POSITION                             0x7
#define _B3SIDL_B3SID2_SIZE                                 0x1
#define _B3SIDL_B3SID2_LENGTH                               0x1
#define _B3SIDL_B3SID2_MASK                                 0x80
#define _B3SIDL_B3EXIDE_POSN                                0x3
#define _B3SIDL_B3EXIDE_POSITION                            0x3
#define _B3SIDL_B3EXIDE_SIZE                                0x1
#define _B3SIDL_B3EXIDE_LENGTH                              0x1
#define _B3SIDL_B3EXIDE_MASK                                0x8

// Register: B3EIDH
#define B3EIDH B3EIDH
extern volatile unsigned char           B3EIDH              __at(0xE53);
#ifndef _LIB_BUILD
asm("B3EIDH equ 0E53h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned B3EID8                 :1;
        unsigned B3EID9                 :1;
        unsigned B3EID10                :1;
        unsigned B3EID11                :1;
        unsigned B3EID12                :1;
        unsigned B3EID13                :1;
        unsigned B3EID14                :1;
        unsigned B3EID15                :1;
    };
} B3EIDHbits_t;
extern volatile B3EIDHbits_t B3EIDHbits __at(0xE53);
// bitfield macros
#define _B3EIDH_EID8_POSN                                   0x0
#define _B3EIDH_EID8_POSITION                               0x0
#define _B3EIDH_EID8_SIZE                                   0x1
#define _B3EIDH_EID8_LENGTH                                 0x1
#define _B3EIDH_EID8_MASK                                   0x1
#define _B3EIDH_EID9_POSN                                   0x1
#define _B3EIDH_EID9_POSITION                               0x1
#define _B3EIDH_EID9_SIZE                                   0x1
#define _B3EIDH_EID9_LENGTH                                 0x1
#define _B3EIDH_EID9_MASK                                   0x2
#define _B3EIDH_EID10_POSN                                  0x2
#define _B3EIDH_EID10_POSITION                              0x2
#define _B3EIDH_EID10_SIZE                                  0x1
#define _B3EIDH_EID10_LENGTH                                0x1
#define _B3EIDH_EID10_MASK                                  0x4
#define _B3EIDH_EID11_POSN                                  0x3
#define _B3EIDH_EID11_POSITION                              0x3
#define _B3EIDH_EID11_SIZE                                  0x1
#define _B3EIDH_EID11_LENGTH                                0x1
#define _B3EIDH_EID11_MASK                                  0x8
#define _B3EIDH_EID12_POSN                                  0x4
#define _B3EIDH_EID12_POSITION                              0x4
#define _B3EIDH_EID12_SIZE                                  0x1
#define _B3EIDH_EID12_LENGTH                                0x1
#define _B3EIDH_EID12_MASK                                  0x10
#define _B3EIDH_EID13_POSN                                  0x5
#define _B3EIDH_EID13_POSITION                              0x5
#define _B3EIDH_EID13_SIZE                                  0x1
#define _B3EIDH_EID13_LENGTH                                0x1
#define _B3EIDH_EID13_MASK                                  0x20
#define _B3EIDH_EID14_POSN                                  0x6
#define _B3EIDH_EID14_POSITION                              0x6
#define _B3EIDH_EID14_SIZE                                  0x1
#define _B3EIDH_EID14_LENGTH                                0x1
#define _B3EIDH_EID14_MASK                                  0x40
#define _B3EIDH_EID15_POSN                                  0x7
#define _B3EIDH_EID15_POSITION                              0x7
#define _B3EIDH_EID15_SIZE                                  0x1
#define _B3EIDH_EID15_LENGTH                                0x1
#define _B3EIDH_EID15_MASK                                  0x80
#define _B3EIDH_B3EID8_POSN                                 0x0
#define _B3EIDH_B3EID8_POSITION                             0x0
#define _B3EIDH_B3EID8_SIZE                                 0x1
#define _B3EIDH_B3EID8_LENGTH                               0x1
#define _B3EIDH_B3EID8_MASK                                 0x1
#define _B3EIDH_B3EID9_POSN                                 0x1
#define _B3EIDH_B3EID9_POSITION                             0x1
#define _B3EIDH_B3EID9_SIZE                                 0x1
#define _B3EIDH_B3EID9_LENGTH                               0x1
#define _B3EIDH_B3EID9_MASK                                 0x2
#define _B3EIDH_B3EID10_POSN                                0x2
#define _B3EIDH_B3EID10_POSITION                            0x2
#define _B3EIDH_B3EID10_SIZE                                0x1
#define _B3EIDH_B3EID10_LENGTH                              0x1
#define _B3EIDH_B3EID10_MASK                                0x4
#define _B3EIDH_B3EID11_POSN                                0x3
#define _B3EIDH_B3EID11_POSITION                            0x3
#define _B3EIDH_B3EID11_SIZE                                0x1
#define _B3EIDH_B3EID11_LENGTH                              0x1
#define _B3EIDH_B3EID11_MASK                                0x8
#define _B3EIDH_B3EID12_POSN                                0x4
#define _B3EIDH_B3EID12_POSITION                            0x4
#define _B3EIDH_B3EID12_SIZE                                0x1
#define _B3EIDH_B3EID12_LENGTH                              0x1
#define _B3EIDH_B3EID12_MASK                                0x10
#define _B3EIDH_B3EID13_POSN                                0x5
#define _B3EIDH_B3EID13_POSITION                            0x5
#define _B3EIDH_B3EID13_SIZE                                0x1
#define _B3EIDH_B3EID13_LENGTH                              0x1
#define _B3EIDH_B3EID13_MASK                                0x20
#define _B3EIDH_B3EID14_POSN                                0x6
#define _B3EIDH_B3EID14_POSITION                            0x6
#define _B3EIDH_B3EID14_SIZE                                0x1
#define _B3EIDH_B3EID14_LENGTH                              0x1
#define _B3EIDH_B3EID14_MASK                                0x40
#define _B3EIDH_B3EID15_POSN                                0x7
#define _B3EIDH_B3EID15_POSITION                            0x7
#define _B3EIDH_B3EID15_SIZE                                0x1
#define _B3EIDH_B3EID15_LENGTH                              0x1
#define _B3EIDH_B3EID15_MASK                                0x80

// Register: B3EIDL
#define B3EIDL B3EIDL
extern volatile unsigned char           B3EIDL              __at(0xE54);
#ifndef _LIB_BUILD
asm("B3EIDL equ 0E54h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned B3EID0                 :1;
        unsigned B3EID1                 :1;
        unsigned B3EID2                 :1;
        unsigned B3EID3                 :1;
        unsigned B3EID4                 :1;
        unsigned B3EID5                 :1;
        unsigned B3EID6                 :1;
        unsigned B3EID7                 :1;
    };
} B3EIDLbits_t;
extern volatile B3EIDLbits_t B3EIDLbits __at(0xE54);
// bitfield macros
#define _B3EIDL_EID0_POSN                                   0x0
#define _B3EIDL_EID0_POSITION                               0x0
#define _B3EIDL_EID0_SIZE                                   0x1
#define _B3EIDL_EID0_LENGTH                                 0x1
#define _B3EIDL_EID0_MASK                                   0x1
#define _B3EIDL_EID1_POSN                                   0x1
#define _B3EIDL_EID1_POSITION                               0x1
#define _B3EIDL_EID1_SIZE                                   0x1
#define _B3EIDL_EID1_LENGTH                                 0x1
#define _B3EIDL_EID1_MASK                                   0x2
#define _B3EIDL_EID2_POSN                                   0x2
#define _B3EIDL_EID2_POSITION                               0x2
#define _B3EIDL_EID2_SIZE                                   0x1
#define _B3EIDL_EID2_LENGTH                                 0x1
#define _B3EIDL_EID2_MASK                                   0x4
#define _B3EIDL_EID3_POSN                                   0x3
#define _B3EIDL_EID3_POSITION                               0x3
#define _B3EIDL_EID3_SIZE                                   0x1
#define _B3EIDL_EID3_LENGTH                                 0x1
#define _B3EIDL_EID3_MASK                                   0x8
#define _B3EIDL_EID4_POSN                                   0x4
#define _B3EIDL_EID4_POSITION                               0x4
#define _B3EIDL_EID4_SIZE                                   0x1
#define _B3EIDL_EID4_LENGTH                                 0x1
#define _B3EIDL_EID4_MASK                                   0x10
#define _B3EIDL_EID5_POSN                                   0x5
#define _B3EIDL_EID5_POSITION                               0x5
#define _B3EIDL_EID5_SIZE                                   0x1
#define _B3EIDL_EID5_LENGTH                                 0x1
#define _B3EIDL_EID5_MASK                                   0x20
#define _B3EIDL_EID6_POSN                                   0x6
#define _B3EIDL_EID6_POSITION                               0x6
#define _B3EIDL_EID6_SIZE                                   0x1
#define _B3EIDL_EID6_LENGTH                                 0x1
#define _B3EIDL_EID6_MASK                                   0x40
#define _B3EIDL_EID7_POSN                                   0x7
#define _B3EIDL_EID7_POSITION                               0x7
#define _B3EIDL_EID7_SIZE                                   0x1
#define _B3EIDL_EID7_LENGTH                                 0x1
#define _B3EIDL_EID7_MASK                                   0x80
#define _B3EIDL_B3EID0_POSN                                 0x0
#define _B3EIDL_B3EID0_POSITION                             0x0
#define _B3EIDL_B3EID0_SIZE                                 0x1
#define _B3EIDL_B3EID0_LENGTH                               0x1
#define _B3EIDL_B3EID0_MASK                                 0x1
#define _B3EIDL_B3EID1_POSN                                 0x1
#define _B3EIDL_B3EID1_POSITION                             0x1
#define _B3EIDL_B3EID1_SIZE                                 0x1
#define _B3EIDL_B3EID1_LENGTH                               0x1
#define _B3EIDL_B3EID1_MASK                                 0x2
#define _B3EIDL_B3EID2_POSN                                 0x2
#define _B3EIDL_B3EID2_POSITION                             0x2
#define _B3EIDL_B3EID2_SIZE                                 0x1
#define _B3EIDL_B3EID2_LENGTH                               0x1
#define _B3EIDL_B3EID2_MASK                                 0x4
#define _B3EIDL_B3EID3_POSN                                 0x3
#define _B3EIDL_B3EID3_POSITION                             0x3
#define _B3EIDL_B3EID3_SIZE                                 0x1
#define _B3EIDL_B3EID3_LENGTH                               0x1
#define _B3EIDL_B3EID3_MASK                                 0x8
#define _B3EIDL_B3EID4_POSN                                 0x4
#define _B3EIDL_B3EID4_POSITION                             0x4
#define _B3EIDL_B3EID4_SIZE                                 0x1
#define _B3EIDL_B3EID4_LENGTH                               0x1
#define _B3EIDL_B3EID4_MASK                                 0x10
#define _B3EIDL_B3EID5_POSN                                 0x5
#define _B3EIDL_B3EID5_POSITION                             0x5
#define _B3EIDL_B3EID5_SIZE                                 0x1
#define _B3EIDL_B3EID5_LENGTH                               0x1
#define _B3EIDL_B3EID5_MASK                                 0x20
#define _B3EIDL_B3EID6_POSN                                 0x6
#define _B3EIDL_B3EID6_POSITION                             0x6
#define _B3EIDL_B3EID6_SIZE                                 0x1
#define _B3EIDL_B3EID6_LENGTH                               0x1
#define _B3EIDL_B3EID6_MASK                                 0x40
#define _B3EIDL_B3EID7_POSN                                 0x7
#define _B3EIDL_B3EID7_POSITION                             0x7
#define _B3EIDL_B3EID7_SIZE                                 0x1
#define _B3EIDL_B3EID7_LENGTH                               0x1
#define _B3EIDL_B3EID7_MASK                                 0x80

// Register: B3DLC
#define B3DLC B3DLC
extern volatile unsigned char           B3DLC               __at(0xE55);
#ifndef _LIB_BUILD
asm("B3DLC equ 0E55h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RXRTR                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned RESRB0                 :1;
        unsigned RESRB1                 :1;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned B3DLC0                 :1;
        unsigned B3DLC1                 :1;
        unsigned B3DLC2                 :1;
        unsigned B3DLC3                 :1;
        unsigned B3RB0                  :1;
        unsigned B3RB1                  :1;
        unsigned B3RXRTR                :1;
    };
} B3DLCbits_t;
