MikroElektronika/core_packages/PIC/XC8/def/PIC18F8585/mcu.h
#define                                 B1D60_bit           _BIT_ACCESS(B1D6,0)
// B1D6<B1D61>
extern volatile __bit                   B1D61               __at(0x71E1);	// @ (0xE3C * 8 + 1)
#define                                 B1D61_bit           _BIT_ACCESS(B1D6,1)
// B1D6<B1D62>
extern volatile __bit                   B1D62               __at(0x71E2);	// @ (0xE3C * 8 + 2)
#define                                 B1D62_bit           _BIT_ACCESS(B1D6,2)
// B1D6<B1D63>
extern volatile __bit                   B1D63               __at(0x71E3);	// @ (0xE3C * 8 + 3)
#define                                 B1D63_bit           _BIT_ACCESS(B1D6,3)
// B1D6<B1D64>
extern volatile __bit                   B1D64               __at(0x71E4);	// @ (0xE3C * 8 + 4)
#define                                 B1D64_bit           _BIT_ACCESS(B1D6,4)
// B1D6<B1D65>
extern volatile __bit                   B1D65               __at(0x71E5);	// @ (0xE3C * 8 + 5)
#define                                 B1D65_bit           _BIT_ACCESS(B1D6,5)
// B1D6<B1D66>
extern volatile __bit                   B1D66               __at(0x71E6);	// @ (0xE3C * 8 + 6)
#define                                 B1D66_bit           _BIT_ACCESS(B1D6,6)
// B1D6<B1D67>
extern volatile __bit                   B1D67               __at(0x71E7);	// @ (0xE3C * 8 + 7)
#define                                 B1D67_bit           _BIT_ACCESS(B1D6,7)
// B1D7<B1D70>
extern volatile __bit                   B1D70               __at(0x71E8);	// @ (0xE3D * 8 + 0)
#define                                 B1D70_bit           _BIT_ACCESS(B1D7,0)
// B1D7<B1D71>
extern volatile __bit                   B1D71               __at(0x71E9);	// @ (0xE3D * 8 + 1)
#define                                 B1D71_bit           _BIT_ACCESS(B1D7,1)
// B1D7<B1D72>
extern volatile __bit                   B1D72               __at(0x71EA);	// @ (0xE3D * 8 + 2)
#define                                 B1D72_bit           _BIT_ACCESS(B1D7,2)
// B1D7<B1D73>
extern volatile __bit                   B1D73               __at(0x71EB);	// @ (0xE3D * 8 + 3)
#define                                 B1D73_bit           _BIT_ACCESS(B1D7,3)
// B1D7<B1D74>
extern volatile __bit                   B1D74               __at(0x71EC);	// @ (0xE3D * 8 + 4)
#define                                 B1D74_bit           _BIT_ACCESS(B1D7,4)
// B1D7<B1D75>
extern volatile __bit                   B1D75               __at(0x71ED);	// @ (0xE3D * 8 + 5)
#define                                 B1D75_bit           _BIT_ACCESS(B1D7,5)
// B1D7<B1D76>
extern volatile __bit                   B1D76               __at(0x71EE);	// @ (0xE3D * 8 + 6)
#define                                 B1D76_bit           _BIT_ACCESS(B1D7,6)
// B1D7<B1D77>
extern volatile __bit                   B1D77               __at(0x71EF);	// @ (0xE3D * 8 + 7)
#define                                 B1D77_bit           _BIT_ACCESS(B1D7,7)
// B1DLC<B1DLC0>
extern volatile __bit                   B1DLC0              __at(0x71A8);	// @ (0xE35 * 8 + 0)
#define                                 B1DLC0_bit          _BIT_ACCESS(B1DLC,0)
// B1DLC<B1DLC1>
extern volatile __bit                   B1DLC1              __at(0x71A9);	// @ (0xE35 * 8 + 1)
#define                                 B1DLC1_bit          _BIT_ACCESS(B1DLC,1)
// B1DLC<B1DLC2>
extern volatile __bit                   B1DLC2              __at(0x71AA);	// @ (0xE35 * 8 + 2)
#define                                 B1DLC2_bit          _BIT_ACCESS(B1DLC,2)
// B1DLC<B1DLC3>
extern volatile __bit                   B1DLC3              __at(0x71AB);	// @ (0xE35 * 8 + 3)
#define                                 B1DLC3_bit          _BIT_ACCESS(B1DLC,3)
// B1EIDL<B1EID0>
extern volatile __bit                   B1EID0              __at(0x71A0);	// @ (0xE34 * 8 + 0)
#define                                 B1EID0_bit          _BIT_ACCESS(B1EIDL,0)
// B1EIDL<B1EID1>
extern volatile __bit                   B1EID1              __at(0x71A1);	// @ (0xE34 * 8 + 1)
#define                                 B1EID1_bit          _BIT_ACCESS(B1EIDL,1)
// B1EIDH<B1EID10>
extern volatile __bit                   B1EID10             __at(0x719A);	// @ (0xE33 * 8 + 2)
#define                                 B1EID10_bit         _BIT_ACCESS(B1EIDH,2)
// B1EIDH<B1EID11>
extern volatile __bit                   B1EID11             __at(0x719B);	// @ (0xE33 * 8 + 3)
#define                                 B1EID11_bit         _BIT_ACCESS(B1EIDH,3)
// B1EIDH<B1EID12>
extern volatile __bit                   B1EID12             __at(0x719C);	// @ (0xE33 * 8 + 4)
#define                                 B1EID12_bit         _BIT_ACCESS(B1EIDH,4)
// B1EIDH<B1EID13>
extern volatile __bit                   B1EID13             __at(0x719D);	// @ (0xE33 * 8 + 5)
#define                                 B1EID13_bit         _BIT_ACCESS(B1EIDH,5)
// B1EIDH<B1EID14>
extern volatile __bit                   B1EID14             __at(0x719E);	// @ (0xE33 * 8 + 6)
#define                                 B1EID14_bit         _BIT_ACCESS(B1EIDH,6)
// B1EIDH<B1EID15>
extern volatile __bit                   B1EID15             __at(0x719F);	// @ (0xE33 * 8 + 7)
#define                                 B1EID15_bit         _BIT_ACCESS(B1EIDH,7)
// B1SIDL<B1EID16>
extern volatile __bit                   B1EID16             __at(0x7190);	// @ (0xE32 * 8 + 0)
#define                                 B1EID16_bit         _BIT_ACCESS(B1SIDL,0)
// B1SIDL<B1EID17>
extern volatile __bit                   B1EID17             __at(0x7191);	// @ (0xE32 * 8 + 1)
#define                                 B1EID17_bit         _BIT_ACCESS(B1SIDL,1)
// B1EIDL<B1EID2>
extern volatile __bit                   B1EID2              __at(0x71A2);	// @ (0xE34 * 8 + 2)
#define                                 B1EID2_bit          _BIT_ACCESS(B1EIDL,2)
// B1EIDL<B1EID3>
extern volatile __bit                   B1EID3              __at(0x71A3);	// @ (0xE34 * 8 + 3)
#define                                 B1EID3_bit          _BIT_ACCESS(B1EIDL,3)
// B1EIDL<B1EID4>
extern volatile __bit                   B1EID4              __at(0x71A4);	// @ (0xE34 * 8 + 4)
#define                                 B1EID4_bit          _BIT_ACCESS(B1EIDL,4)
// B1EIDL<B1EID5>
extern volatile __bit                   B1EID5              __at(0x71A5);	// @ (0xE34 * 8 + 5)
#define                                 B1EID5_bit          _BIT_ACCESS(B1EIDL,5)
// B1EIDL<B1EID6>
extern volatile __bit                   B1EID6              __at(0x71A6);	// @ (0xE34 * 8 + 6)
#define                                 B1EID6_bit          _BIT_ACCESS(B1EIDL,6)
// B1EIDL<B1EID7>
extern volatile __bit                   B1EID7              __at(0x71A7);	// @ (0xE34 * 8 + 7)
#define                                 B1EID7_bit          _BIT_ACCESS(B1EIDL,7)
// B1EIDH<B1EID8>
extern volatile __bit                   B1EID8              __at(0x7198);	// @ (0xE33 * 8 + 0)
#define                                 B1EID8_bit          _BIT_ACCESS(B1EIDH,0)
// B1EIDH<B1EID9>
extern volatile __bit                   B1EID9              __at(0x7199);	// @ (0xE33 * 8 + 1)
#define                                 B1EID9_bit          _BIT_ACCESS(B1EIDH,1)
// B1SIDL<B1EXID>
extern volatile __bit                   B1EXID              __at(0x7193);	// @ (0xE32 * 8 + 3)
#define                                 B1EXID_bit          _BIT_ACCESS(B1SIDL,3)
// B1CON<B1FILHIT0>
extern volatile __bit                   B1FILHIT0           __at(0x7180);	// @ (0xE30 * 8 + 0)
#define                                 B1FILHIT0_bit       _BIT_ACCESS(B1CON,0)
// B1CON<B1FILHIT1>
extern volatile __bit                   B1FILHIT1           __at(0x7181);	// @ (0xE30 * 8 + 1)
#define                                 B1FILHIT1_bit       _BIT_ACCESS(B1CON,1)
// B1CON<B1FILHIT2>
extern volatile __bit                   B1FILHIT2           __at(0x7182);	// @ (0xE30 * 8 + 2)
#define                                 B1FILHIT2_bit       _BIT_ACCESS(B1CON,2)
// B1CON<B1FILHIT3>
extern volatile __bit                   B1FILHIT3           __at(0x7183);	// @ (0xE30 * 8 + 3)
#define                                 B1FILHIT3_bit       _BIT_ACCESS(B1CON,3)
// B1CON<B1FILHIT4>
extern volatile __bit                   B1FILHIT4           __at(0x7184);	// @ (0xE30 * 8 + 4)
#define                                 B1FILHIT4_bit       _BIT_ACCESS(B1CON,4)
// BIE0<B1IE>
extern volatile __bit                   B1IE                __at(0x6FD3);	// @ (0xDFA * 8 + 3)
#define                                 B1IE_bit            _BIT_ACCESS(BIE0,3)
// B1DLC<B1RB0>
extern volatile __bit                   B1RB0               __at(0x71AC);	// @ (0xE35 * 8 + 4)
#define                                 B1RB0_bit           _BIT_ACCESS(B1DLC,4)
// B1DLC<B1RB1>
extern volatile __bit                   B1RB1               __at(0x71AD);	// @ (0xE35 * 8 + 5)
#define                                 B1RB1_bit           _BIT_ACCESS(B1DLC,5)
// B1CON<B1RTREN>
extern volatile __bit                   B1RTREN             __at(0x7182);	// @ (0xE30 * 8 + 2)
#define                                 B1RTREN_bit         _BIT_ACCESS(B1CON,2)
// B1CON<B1RTRRO>
extern volatile __bit                   B1RTRRO             __at(0x7185);	// @ (0xE30 * 8 + 5)
#define                                 B1RTRRO_bit         _BIT_ACCESS(B1CON,5)
// B1CON<B1RXFUL>
extern volatile __bit                   B1RXFUL             __at(0x7187);	// @ (0xE30 * 8 + 7)
#define                                 B1RXFUL_bit         _BIT_ACCESS(B1CON,7)
// B1CON<B1RXM1>
extern volatile __bit                   B1RXM1              __at(0x7186);	// @ (0xE30 * 8 + 6)
#define                                 B1RXM1_bit          _BIT_ACCESS(B1CON,6)
// B1DLC<B1RXRTR>
extern volatile __bit                   B1RXRTR             __at(0x71AE);	// @ (0xE35 * 8 + 6)
#define                                 B1RXRTR_bit         _BIT_ACCESS(B1DLC,6)
// B1SIDL<B1SID0>
extern volatile __bit                   B1SID0              __at(0x7195);	// @ (0xE32 * 8 + 5)
#define                                 B1SID0_bit          _BIT_ACCESS(B1SIDL,5)
// B1SIDL<B1SID1>
extern volatile __bit                   B1SID1              __at(0x7196);	// @ (0xE32 * 8 + 6)
#define                                 B1SID1_bit          _BIT_ACCESS(B1SIDL,6)
// B1SIDH<B1SID10>
extern volatile __bit                   B1SID10             __at(0x718F);	// @ (0xE31 * 8 + 7)
#define                                 B1SID10_bit         _BIT_ACCESS(B1SIDH,7)
// B1SIDL<B1SID2>
extern volatile __bit                   B1SID2              __at(0x7197);	// @ (0xE32 * 8 + 7)
#define                                 B1SID2_bit          _BIT_ACCESS(B1SIDL,7)
// B1SIDH<B1SID3>
extern volatile __bit                   B1SID3              __at(0x7188);	// @ (0xE31 * 8 + 0)
#define                                 B1SID3_bit          _BIT_ACCESS(B1SIDH,0)
// B1SIDH<B1SID4>
extern volatile __bit                   B1SID4              __at(0x7189);	// @ (0xE31 * 8 + 1)
#define                                 B1SID4_bit          _BIT_ACCESS(B1SIDH,1)
// B1SIDH<B1SID5>
extern volatile __bit                   B1SID5              __at(0x718A);	// @ (0xE31 * 8 + 2)
#define                                 B1SID5_bit          _BIT_ACCESS(B1SIDH,2)
// B1SIDH<B1SID6>
extern volatile __bit                   B1SID6              __at(0x718B);	// @ (0xE31 * 8 + 3)
#define                                 B1SID6_bit          _BIT_ACCESS(B1SIDH,3)
// B1SIDH<B1SID7>
extern volatile __bit                   B1SID7              __at(0x718C);	// @ (0xE31 * 8 + 4)
#define                                 B1SID7_bit          _BIT_ACCESS(B1SIDH,4)
// B1SIDH<B1SID8>
extern volatile __bit                   B1SID8              __at(0x718D);	// @ (0xE31 * 8 + 5)
#define                                 B1SID8_bit          _BIT_ACCESS(B1SIDH,5)
// B1SIDH<B1SID9>
extern volatile __bit                   B1SID9              __at(0x718E);	// @ (0xE31 * 8 + 6)
#define                                 B1SID9_bit          _BIT_ACCESS(B1SIDH,6)
// B1SIDL<B1SRR>
extern volatile __bit                   B1SRR               __at(0x7194);	// @ (0xE32 * 8 + 4)
#define                                 B1SRR_bit           _BIT_ACCESS(B1SIDL,4)
// B1CON<B1TXABT>
extern volatile __bit                   B1TXABT             __at(0x7186);	// @ (0xE30 * 8 + 6)
#define                                 B1TXABT_bit         _BIT_ACCESS(B1CON,6)
// B1CON<B1TXB3IF>
extern volatile __bit                   B1TXB3IF            __at(0x7187);	// @ (0xE30 * 8 + 7)
#define                                 B1TXB3IF_bit        _BIT_ACCESS(B1CON,7)
// BSEL0<B1TXEN>
extern volatile __bit                   B1TXEN              __at(0x6FC3);	// @ (0xDF8 * 8 + 3)
#define                                 B1TXEN_bit          _BIT_ACCESS(BSEL0,3)
// B1CON<B1TXERR>
extern volatile __bit                   B1TXERR             __at(0x7184);	// @ (0xE30 * 8 + 4)
#define                                 B1TXERR_bit         _BIT_ACCESS(B1CON,4)
// B1CON<B1TXLARB>
extern volatile __bit                   B1TXLARB            __at(0x7185);	// @ (0xE30 * 8 + 5)
#define                                 B1TXLARB_bit        _BIT_ACCESS(B1CON,5)
// B1CON<B1TXPRI0>
extern volatile __bit                   B1TXPRI0            __at(0x7180);	// @ (0xE30 * 8 + 0)
#define                                 B1TXPRI0_bit        _BIT_ACCESS(B1CON,0)
// B1CON<B1TXPRI1>
extern volatile __bit                   B1TXPRI1            __at(0x7181);	// @ (0xE30 * 8 + 1)
#define                                 B1TXPRI1_bit        _BIT_ACCESS(B1CON,1)
// B1CON<B1TXREQ>
extern volatile __bit                   B1TXREQ             __at(0x7183);	// @ (0xE30 * 8 + 3)
#define                                 B1TXREQ_bit         _BIT_ACCESS(B1CON,3)
// B2D0<B2D00>
extern volatile __bit                   B2D00               __at(0x7230);	// @ (0xE46 * 8 + 0)
#define                                 B2D00_bit           _BIT_ACCESS(B2D0,0)
// B2D0<B2D01>
extern volatile __bit                   B2D01               __at(0x7231);	// @ (0xE46 * 8 + 1)
#define                                 B2D01_bit           _BIT_ACCESS(B2D0,1)
// B2D0<B2D02>
extern volatile __bit                   B2D02               __at(0x7232);	// @ (0xE46 * 8 + 2)
#define                                 B2D02_bit           _BIT_ACCESS(B2D0,2)
// B2D0<B2D03>
extern volatile __bit                   B2D03               __at(0x7233);	// @ (0xE46 * 8 + 3)
#define                                 B2D03_bit           _BIT_ACCESS(B2D0,3)
// B2D0<B2D04>
extern volatile __bit                   B2D04               __at(0x7234);	// @ (0xE46 * 8 + 4)
#define                                 B2D04_bit           _BIT_ACCESS(B2D0,4)
// B2D0<B2D05>
extern volatile __bit                   B2D05               __at(0x7235);	// @ (0xE46 * 8 + 5)
#define                                 B2D05_bit           _BIT_ACCESS(B2D0,5)
// B2D0<B2D06>
extern volatile __bit                   B2D06               __at(0x7236);	// @ (0xE46 * 8 + 6)
#define                                 B2D06_bit           _BIT_ACCESS(B2D0,6)
// B2D0<B2D07>
extern volatile __bit                   B2D07               __at(0x7237);	// @ (0xE46 * 8 + 7)
#define                                 B2D07_bit           _BIT_ACCESS(B2D0,7)
// B2D1<B2D10>
extern volatile __bit                   B2D10               __at(0x7238);	// @ (0xE47 * 8 + 0)
#define                                 B2D10_bit           _BIT_ACCESS(B2D1,0)
// B2D1<B2D11>
extern volatile __bit                   B2D11               __at(0x7239);	// @ (0xE47 * 8 + 1)
#define                                 B2D11_bit           _BIT_ACCESS(B2D1,1)
// B2D1<B2D12>
extern volatile __bit                   B2D12               __at(0x723A);	// @ (0xE47 * 8 + 2)
#define                                 B2D12_bit           _BIT_ACCESS(B2D1,2)
// B2D1<B2D13>
extern volatile __bit                   B2D13               __at(0x723B);	// @ (0xE47 * 8 + 3)
#define                                 B2D13_bit           _BIT_ACCESS(B2D1,3)
// B2D1<B2D14>
extern volatile __bit                   B2D14               __at(0x723C);	// @ (0xE47 * 8 + 4)
#define                                 B2D14_bit           _BIT_ACCESS(B2D1,4)
// B2D1<B2D15>
extern volatile __bit                   B2D15               __at(0x723D);	// @ (0xE47 * 8 + 5)
#define                                 B2D15_bit           _BIT_ACCESS(B2D1,5)
// B2D1<B2D16>
extern volatile __bit                   B2D16               __at(0x723E);	// @ (0xE47 * 8 + 6)
#define                                 B2D16_bit           _BIT_ACCESS(B2D1,6)
// B2D1<B2D17>
extern volatile __bit                   B2D17               __at(0x723F);	// @ (0xE47 * 8 + 7)
#define                                 B2D17_bit           _BIT_ACCESS(B2D1,7)
// B2D2<B2D20>
extern volatile __bit                   B2D20               __at(0x7240);	// @ (0xE48 * 8 + 0)
#define                                 B2D20_bit           _BIT_ACCESS(B2D2,0)
// B2D2<B2D21>
extern volatile __bit                   B2D21               __at(0x7241);	// @ (0xE48 * 8 + 1)
#define                                 B2D21_bit           _BIT_ACCESS(B2D2,1)
// B2D2<B2D22>
extern volatile __bit                   B2D22               __at(0x7242);	// @ (0xE48 * 8 + 2)
#define                                 B2D22_bit           _BIT_ACCESS(B2D2,2)
// B2D2<B2D23>
extern volatile __bit                   B2D23               __at(0x7243);	// @ (0xE48 * 8 + 3)
#define                                 B2D23_bit           _BIT_ACCESS(B2D2,3)
// B2D2<B2D24>
extern volatile __bit                   B2D24               __at(0x7244);	// @ (0xE48 * 8 + 4)
#define                                 B2D24_bit           _BIT_ACCESS(B2D2,4)
// B2D2<B2D25>
extern volatile __bit                   B2D25               __at(0x7245);	// @ (0xE48 * 8 + 5)
#define                                 B2D25_bit           _BIT_ACCESS(B2D2,5)
// B2D2<B2D26>
extern volatile __bit                   B2D26               __at(0x7246);	// @ (0xE48 * 8 + 6)
#define                                 B2D26_bit           _BIT_ACCESS(B2D2,6)
// B2D2<B2D27>
extern volatile __bit                   B2D27               __at(0x7247);	// @ (0xE48 * 8 + 7)
#define                                 B2D27_bit           _BIT_ACCESS(B2D2,7)
// B2D3<B2D30>
extern volatile __bit                   B2D30               __at(0x7248);	// @ (0xE49 * 8 + 0)
#define                                 B2D30_bit           _BIT_ACCESS(B2D3,0)
// B2D3<B2D31>
extern volatile __bit                   B2D31               __at(0x7249);	// @ (0xE49 * 8 + 1)
#define                                 B2D31_bit           _BIT_ACCESS(B2D3,1)
// B2D3<B2D32>
extern volatile __bit                   B2D32               __at(0x724A);	// @ (0xE49 * 8 + 2)
#define                                 B2D32_bit           _BIT_ACCESS(B2D3,2)
// B2D3<B2D33>
extern volatile __bit                   B2D33               __at(0x724B);	// @ (0xE49 * 8 + 3)
#define                                 B2D33_bit           _BIT_ACCESS(B2D3,3)
// B2D3<B2D34>
extern volatile __bit                   B2D34               __at(0x724C);	// @ (0xE49 * 8 + 4)
#define                                 B2D34_bit           _BIT_ACCESS(B2D3,4)
// B2D3<B2D35>
extern volatile __bit                   B2D35               __at(0x724D);	// @ (0xE49 * 8 + 5)
#define                                 B2D35_bit           _BIT_ACCESS(B2D3,5)
// B2D3<B2D36>
extern volatile __bit                   B2D36               __at(0x724E);	// @ (0xE49 * 8 + 6)
#define                                 B2D36_bit           _BIT_ACCESS(B2D3,6)
// B2D3<B2D37>
extern volatile __bit                   B2D37               __at(0x724F);	// @ (0xE49 * 8 + 7)
#define                                 B2D37_bit           _BIT_ACCESS(B2D3,7)
// B2D4<B2D40>
extern volatile __bit                   B2D40               __at(0x7250);	// @ (0xE4A * 8 + 0)
#define                                 B2D40_bit           _BIT_ACCESS(B2D4,0)
// B2D4<B2D41>
extern volatile __bit                   B2D41               __at(0x7251);	// @ (0xE4A * 8 + 1)
#define                                 B2D41_bit           _BIT_ACCESS(B2D4,1)
// B2D4<B2D42>
extern volatile __bit                   B2D42               __at(0x7252);	// @ (0xE4A * 8 + 2)
#define                                 B2D42_bit           _BIT_ACCESS(B2D4,2)
// B2D4<B2D43>
extern volatile __bit                   B2D43               __at(0x7253);	// @ (0xE4A * 8 + 3)
#define                                 B2D43_bit           _BIT_ACCESS(B2D4,3)
// B2D4<B2D44>
extern volatile __bit                   B2D44               __at(0x7254);	// @ (0xE4A * 8 + 4)
#define                                 B2D44_bit           _BIT_ACCESS(B2D4,4)
// B2D4<B2D45>
extern volatile __bit                   B2D45               __at(0x7255);	// @ (0xE4A * 8 + 5)
#define                                 B2D45_bit           _BIT_ACCESS(B2D4,5)
// B2D4<B2D46>
extern volatile __bit                   B2D46               __at(0x7256);	// @ (0xE4A * 8 + 6)
#define                                 B2D46_bit           _BIT_ACCESS(B2D4,6)
// B2D4<B2D47>
extern volatile __bit                   B2D47               __at(0x7257);	// @ (0xE4A * 8 + 7)
#define                                 B2D47_bit           _BIT_ACCESS(B2D4,7)
// B2D5<B2D50>
extern volatile __bit                   B2D50               __at(0x7258);	// @ (0xE4B * 8 + 0)
#define                                 B2D50_bit           _BIT_ACCESS(B2D5,0)
// B2D5<B2D51>
extern volatile __bit                   B2D51               __at(0x7259);	// @ (0xE4B * 8 + 1)
#define                                 B2D51_bit           _BIT_ACCESS(B2D5,1)
// B2D5<B2D52>
extern volatile __bit                   B2D52               __at(0x725A);	// @ (0xE4B * 8 + 2)
#define                                 B2D52_bit           _BIT_ACCESS(B2D5,2)
// B2D5<B2D53>
extern volatile __bit                   B2D53               __at(0x725B);	// @ (0xE4B * 8 + 3)
#define                                 B2D53_bit           _BIT_ACCESS(B2D5,3)
// B2D5<B2D54>
extern volatile __bit                   B2D54               __at(0x725C);	// @ (0xE4B * 8 + 4)
#define                                 B2D54_bit           _BIT_ACCESS(B2D5,4)
// B2D5<B2D55>
extern volatile __bit                   B2D55               __at(0x725D);	// @ (0xE4B * 8 + 5)
#define                                 B2D55_bit           _BIT_ACCESS(B2D5,5)
// B2D5<B2D56>
extern volatile __bit                   B2D56               __at(0x725E);	// @ (0xE4B * 8 + 6)
#define                                 B2D56_bit           _BIT_ACCESS(B2D5,6)
// B2D5<B2D57>
extern volatile __bit                   B2D57               __at(0x725F);	// @ (0xE4B * 8 + 7)
#define                                 B2D57_bit           _BIT_ACCESS(B2D5,7)
// B2D6<B2D60>
extern volatile __bit                   B2D60               __at(0x7260);	// @ (0xE4C * 8 + 0)
#define                                 B2D60_bit           _BIT_ACCESS(B2D6,0)
// B2D6<B2D61>
extern volatile __bit                   B2D61               __at(0x7261);	// @ (0xE4C * 8 + 1)
#define                                 B2D61_bit           _BIT_ACCESS(B2D6,1)
// B2D6<B2D62>
extern volatile __bit                   B2D62               __at(0x7262);	// @ (0xE4C * 8 + 2)
#define                                 B2D62_bit           _BIT_ACCESS(B2D6,2)
// B2D6<B2D63>
extern volatile __bit                   B2D63               __at(0x7263);	// @ (0xE4C * 8 + 3)
#define                                 B2D63_bit           _BIT_ACCESS(B2D6,3)
// B2D6<B2D64>
extern volatile __bit                   B2D64               __at(0x7264);	// @ (0xE4C * 8 + 4)
#define                                 B2D64_bit           _BIT_ACCESS(B2D6,4)
// B2D6<B2D65>
