MikroElektronika/core_packages/PIC/XC8/def/PIC18F8585/mcu.h
#define                                 B5D74_bit           _BIT_ACCESS(B5D7,4)
// B5D7<B5D75>
extern volatile __bit                   B5D75               __at(0x73ED);	// @ (0xE7D * 8 + 5)
#define                                 B5D75_bit           _BIT_ACCESS(B5D7,5)
// B5D7<B5D76>
extern volatile __bit                   B5D76               __at(0x73EE);	// @ (0xE7D * 8 + 6)
#define                                 B5D76_bit           _BIT_ACCESS(B5D7,6)
// B5D7<B5D77>
extern volatile __bit                   B5D77               __at(0x73EF);	// @ (0xE7D * 8 + 7)
#define                                 B5D77_bit           _BIT_ACCESS(B5D7,7)
// B5DLC<B5DLC0>
extern volatile __bit                   B5DLC0              __at(0x73A8);	// @ (0xE75 * 8 + 0)
#define                                 B5DLC0_bit          _BIT_ACCESS(B5DLC,0)
// B5DLC<B5DLC1>
extern volatile __bit                   B5DLC1              __at(0x73A9);	// @ (0xE75 * 8 + 1)
#define                                 B5DLC1_bit          _BIT_ACCESS(B5DLC,1)
// B5DLC<B5DLC2>
extern volatile __bit                   B5DLC2              __at(0x73AA);	// @ (0xE75 * 8 + 2)
#define                                 B5DLC2_bit          _BIT_ACCESS(B5DLC,2)
// B5DLC<B5DLC3>
extern volatile __bit                   B5DLC3              __at(0x73AB);	// @ (0xE75 * 8 + 3)
#define                                 B5DLC3_bit          _BIT_ACCESS(B5DLC,3)
// B5EIDL<B5EID0>
extern volatile __bit                   B5EID0              __at(0x73A0);	// @ (0xE74 * 8 + 0)
#define                                 B5EID0_bit          _BIT_ACCESS(B5EIDL,0)
// B5EIDL<B5EID1>
extern volatile __bit                   B5EID1              __at(0x73A1);	// @ (0xE74 * 8 + 1)
#define                                 B5EID1_bit          _BIT_ACCESS(B5EIDL,1)
// B5EIDH<B5EID10>
extern volatile __bit                   B5EID10             __at(0x739A);	// @ (0xE73 * 8 + 2)
#define                                 B5EID10_bit         _BIT_ACCESS(B5EIDH,2)
// B5EIDH<B5EID11>
extern volatile __bit                   B5EID11             __at(0x739B);	// @ (0xE73 * 8 + 3)
#define                                 B5EID11_bit         _BIT_ACCESS(B5EIDH,3)
// B5EIDH<B5EID12>
extern volatile __bit                   B5EID12             __at(0x739C);	// @ (0xE73 * 8 + 4)
#define                                 B5EID12_bit         _BIT_ACCESS(B5EIDH,4)
// B5EIDH<B5EID13>
extern volatile __bit                   B5EID13             __at(0x739D);	// @ (0xE73 * 8 + 5)
#define                                 B5EID13_bit         _BIT_ACCESS(B5EIDH,5)
// B5EIDH<B5EID14>
extern volatile __bit                   B5EID14             __at(0x739E);	// @ (0xE73 * 8 + 6)
#define                                 B5EID14_bit         _BIT_ACCESS(B5EIDH,6)
// B5EIDH<B5EID15>
extern volatile __bit                   B5EID15             __at(0x739F);	// @ (0xE73 * 8 + 7)
#define                                 B5EID15_bit         _BIT_ACCESS(B5EIDH,7)
// B5SIDL<B5EID16>
extern volatile __bit                   B5EID16             __at(0x7390);	// @ (0xE72 * 8 + 0)
#define                                 B5EID16_bit         _BIT_ACCESS(B5SIDL,0)
// B5SIDL<B5EID17>
extern volatile __bit                   B5EID17             __at(0x7391);	// @ (0xE72 * 8 + 1)
#define                                 B5EID17_bit         _BIT_ACCESS(B5SIDL,1)
// B5EIDL<B5EID2>
extern volatile __bit                   B5EID2              __at(0x73A2);	// @ (0xE74 * 8 + 2)
#define                                 B5EID2_bit          _BIT_ACCESS(B5EIDL,2)
// B5EIDL<B5EID3>
extern volatile __bit                   B5EID3              __at(0x73A3);	// @ (0xE74 * 8 + 3)
#define                                 B5EID3_bit          _BIT_ACCESS(B5EIDL,3)
// B5EIDL<B5EID4>
extern volatile __bit                   B5EID4              __at(0x73A4);	// @ (0xE74 * 8 + 4)
#define                                 B5EID4_bit          _BIT_ACCESS(B5EIDL,4)
// B5EIDL<B5EID5>
extern volatile __bit                   B5EID5              __at(0x73A5);	// @ (0xE74 * 8 + 5)
#define                                 B5EID5_bit          _BIT_ACCESS(B5EIDL,5)
// B5EIDL<B5EID6>
extern volatile __bit                   B5EID6              __at(0x73A6);	// @ (0xE74 * 8 + 6)
#define                                 B5EID6_bit          _BIT_ACCESS(B5EIDL,6)
// B5EIDL<B5EID7>
extern volatile __bit                   B5EID7              __at(0x73A7);	// @ (0xE74 * 8 + 7)
#define                                 B5EID7_bit          _BIT_ACCESS(B5EIDL,7)
// B5EIDH<B5EID8>
extern volatile __bit                   B5EID8              __at(0x7398);	// @ (0xE73 * 8 + 0)
#define                                 B5EID8_bit          _BIT_ACCESS(B5EIDH,0)
// B5EIDH<B5EID9>
extern volatile __bit                   B5EID9              __at(0x7399);	// @ (0xE73 * 8 + 1)
#define                                 B5EID9_bit          _BIT_ACCESS(B5EIDH,1)
// B5SIDL<B5EXID>
extern volatile __bit                   B5EXID              __at(0x7393);	// @ (0xE72 * 8 + 3)
#define                                 B5EXID_bit          _BIT_ACCESS(B5SIDL,3)
// B5SIDL<B5EXIDE>
extern volatile __bit                   B5EXIDE             __at(0x7393);	// @ (0xE72 * 8 + 3)
#define                                 B5EXIDE_bit         _BIT_ACCESS(B5SIDL,3)
// B5CON<B5FILHIT0>
extern volatile __bit                   B5FILHIT0           __at(0x7380);	// @ (0xE70 * 8 + 0)
#define                                 B5FILHIT0_bit       _BIT_ACCESS(B5CON,0)
// B5CON<B5FILHIT1>
extern volatile __bit                   B5FILHIT1           __at(0x7381);	// @ (0xE70 * 8 + 1)
#define                                 B5FILHIT1_bit       _BIT_ACCESS(B5CON,1)
// B5CON<B5FILHIT2>
extern volatile __bit                   B5FILHIT2           __at(0x7382);	// @ (0xE70 * 8 + 2)
#define                                 B5FILHIT2_bit       _BIT_ACCESS(B5CON,2)
// B5CON<B5FILHIT3>
extern volatile __bit                   B5FILHIT3           __at(0x7383);	// @ (0xE70 * 8 + 3)
#define                                 B5FILHIT3_bit       _BIT_ACCESS(B5CON,3)
// B5CON<B5FILHIT4>
extern volatile __bit                   B5FILHIT4           __at(0x7384);	// @ (0xE70 * 8 + 4)
#define                                 B5FILHIT4_bit       _BIT_ACCESS(B5CON,4)
// BIE0<B5IE>
extern volatile __bit                   B5IE                __at(0x6FD7);	// @ (0xDFA * 8 + 7)
#define                                 B5IE_bit            _BIT_ACCESS(BIE0,7)
// B5DLC<B5RB0>
extern volatile __bit                   B5RB0               __at(0x73AC);	// @ (0xE75 * 8 + 4)
#define                                 B5RB0_bit           _BIT_ACCESS(B5DLC,4)
// B5DLC<B5RB1>
extern volatile __bit                   B5RB1               __at(0x73AD);	// @ (0xE75 * 8 + 5)
#define                                 B5RB1_bit           _BIT_ACCESS(B5DLC,5)
// B5CON<B5RTREN>
extern volatile __bit                   B5RTREN             __at(0x7382);	// @ (0xE70 * 8 + 2)
#define                                 B5RTREN_bit         _BIT_ACCESS(B5CON,2)
// B5CON<B5RTRRO>
extern volatile __bit                   B5RTRRO             __at(0x7385);	// @ (0xE70 * 8 + 5)
#define                                 B5RTRRO_bit         _BIT_ACCESS(B5CON,5)
// B5CON<B5RXFUL>
extern volatile __bit                   B5RXFUL             __at(0x7387);	// @ (0xE70 * 8 + 7)
#define                                 B5RXFUL_bit         _BIT_ACCESS(B5CON,7)
// B5CON<B5RXM1>
extern volatile __bit                   B5RXM1              __at(0x7386);	// @ (0xE70 * 8 + 6)
#define                                 B5RXM1_bit          _BIT_ACCESS(B5CON,6)
// B5DLC<B5RXRTR>
extern volatile __bit                   B5RXRTR             __at(0x73AE);	// @ (0xE75 * 8 + 6)
#define                                 B5RXRTR_bit         _BIT_ACCESS(B5DLC,6)
// B5SIDL<B5SID0>
extern volatile __bit                   B5SID0              __at(0x7395);	// @ (0xE72 * 8 + 5)
#define                                 B5SID0_bit          _BIT_ACCESS(B5SIDL,5)
// B5SIDL<B5SID1>
extern volatile __bit                   B5SID1              __at(0x7396);	// @ (0xE72 * 8 + 6)
#define                                 B5SID1_bit          _BIT_ACCESS(B5SIDL,6)
// B5SIDH<B5SID10>
extern volatile __bit                   B5SID10             __at(0x738F);	// @ (0xE71 * 8 + 7)
#define                                 B5SID10_bit         _BIT_ACCESS(B5SIDH,7)
// B5SIDL<B5SID2>
extern volatile __bit                   B5SID2              __at(0x7397);	// @ (0xE72 * 8 + 7)
#define                                 B5SID2_bit          _BIT_ACCESS(B5SIDL,7)
// B5SIDH<B5SID3>
extern volatile __bit                   B5SID3              __at(0x7388);	// @ (0xE71 * 8 + 0)
#define                                 B5SID3_bit          _BIT_ACCESS(B5SIDH,0)
// B5SIDH<B5SID4>
extern volatile __bit                   B5SID4              __at(0x7389);	// @ (0xE71 * 8 + 1)
#define                                 B5SID4_bit          _BIT_ACCESS(B5SIDH,1)
// B5SIDH<B5SID5>
extern volatile __bit                   B5SID5              __at(0x738A);	// @ (0xE71 * 8 + 2)
#define                                 B5SID5_bit          _BIT_ACCESS(B5SIDH,2)
// B5SIDH<B5SID6>
extern volatile __bit                   B5SID6              __at(0x738B);	// @ (0xE71 * 8 + 3)
#define                                 B5SID6_bit          _BIT_ACCESS(B5SIDH,3)
// B5SIDH<B5SID7>
extern volatile __bit                   B5SID7              __at(0x738C);	// @ (0xE71 * 8 + 4)
#define                                 B5SID7_bit          _BIT_ACCESS(B5SIDH,4)
// B5SIDH<B5SID8>
extern volatile __bit                   B5SID8              __at(0x738D);	// @ (0xE71 * 8 + 5)
#define                                 B5SID8_bit          _BIT_ACCESS(B5SIDH,5)
// B5SIDH<B5SID9>
extern volatile __bit                   B5SID9              __at(0x738E);	// @ (0xE71 * 8 + 6)
#define                                 B5SID9_bit          _BIT_ACCESS(B5SIDH,6)
// B5SIDL<B5SRR>
extern volatile __bit                   B5SRR               __at(0x7394);	// @ (0xE72 * 8 + 4)
#define                                 B5SRR_bit           _BIT_ACCESS(B5SIDL,4)
// B5CON<B5TXABT>
extern volatile __bit                   B5TXABT             __at(0x7386);	// @ (0xE70 * 8 + 6)
#define                                 B5TXABT_bit         _BIT_ACCESS(B5CON,6)
// B5CON<B5TXBIF>
extern volatile __bit                   B5TXBIF             __at(0x7387);	// @ (0xE70 * 8 + 7)
#define                                 B5TXBIF_bit         _BIT_ACCESS(B5CON,7)
// BSEL0<B5TXEN>
extern volatile __bit                   B5TXEN              __at(0x6FC7);	// @ (0xDF8 * 8 + 7)
#define                                 B5TXEN_bit          _BIT_ACCESS(BSEL0,7)
// B5CON<B5TXERR>
extern volatile __bit                   B5TXERR             __at(0x7384);	// @ (0xE70 * 8 + 4)
#define                                 B5TXERR_bit         _BIT_ACCESS(B5CON,4)
// B5CON<B5TXLARB>
extern volatile __bit                   B5TXLARB            __at(0x7385);	// @ (0xE70 * 8 + 5)
#define                                 B5TXLARB_bit        _BIT_ACCESS(B5CON,5)
// B5CON<B5TXPRI0>
extern volatile __bit                   B5TXPRI0            __at(0x7380);	// @ (0xE70 * 8 + 0)
#define                                 B5TXPRI0_bit        _BIT_ACCESS(B5CON,0)
// B5CON<B5TXPRI1>
extern volatile __bit                   B5TXPRI1            __at(0x7381);	// @ (0xE70 * 8 + 1)
#define                                 B5TXPRI1_bit        _BIT_ACCESS(B5CON,1)
// B5CON<B5TXREQ>
extern volatile __bit                   B5TXREQ             __at(0x7383);	// @ (0xE70 * 8 + 3)
#define                                 B5TXREQ_bit         _BIT_ACCESS(B5CON,3)
// PORTJ<BA0>
extern volatile __bit                   BA0                 __at(0x7C44);	// @ (0xF88 * 8 + 4)
#define                                 BA0_bit             _BIT_ACCESS(PORTJ,4)
// PIE2<BCLIE>
extern volatile __bit                   BCLIE               __at(0x7D03);	// @ (0xFA0 * 8 + 3)
#define                                 BCLIE_bit           _BIT_ACCESS(PIE2,3)
// PIR2<BCLIF>
extern volatile __bit                   BCLIF               __at(0x7D0B);	// @ (0xFA1 * 8 + 3)
#define                                 BCLIF_bit           _BIT_ACCESS(PIR2,3)
// IPR2<BCLIP>
extern volatile __bit                   BCLIP               __at(0x7D13);	// @ (0xFA2 * 8 + 3)
#define                                 BCLIP_bit           _BIT_ACCESS(IPR2,3)
// SSPSTAT<BF>
extern volatile __bit                   BF                  __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 BF_bit              _BIT_ACCESS(SSPSTAT,0)
// LVDCON<BGST>
extern volatile __bit                   BGST                __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 BGST_bit            _BIT_ACCESS(LVDCON,5)
// RCON<BOR>
extern volatile __bit                   BOR                 __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(RCON,0)
// BAUDCON<BRG16>
extern volatile __bit                   BRG16               __at(0x7BF3);	// @ (0xF7E * 8 + 3)
#define                                 BRG16_bit           _BIT_ACCESS(BAUDCON,3)
// TXSTA<BRGH>
extern volatile __bit                   BRGH                __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH_bit            _BIT_ACCESS(TXSTA,2)
// TXSTA<BRGH1>
extern volatile __bit                   BRGH1               __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH1_bit           _BIT_ACCESS(TXSTA,2)
// BRGCON1<BRP0>
extern volatile __bit                   BRP0                __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 BRP0_bit            _BIT_ACCESS(BRGCON1,0)
// BRGCON1<BRP1>
extern volatile __bit                   BRP1                __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 BRP1_bit            _BIT_ACCESS(BRGCON1,1)
// BRGCON1<BRP2>
extern volatile __bit                   BRP2                __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 BRP2_bit            _BIT_ACCESS(BRGCON1,2)
// BRGCON1<BRP3>
extern volatile __bit                   BRP3                __at(0x7B83);	// @ (0xF70 * 8 + 3)
#define                                 BRP3_bit            _BIT_ACCESS(BRGCON1,3)
// BRGCON1<BRP4>
extern volatile __bit                   BRP4                __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 BRP4_bit            _BIT_ACCESS(BRGCON1,4)
// BRGCON1<BRP5>
extern volatile __bit                   BRP5                __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 BRP5_bit            _BIT_ACCESS(BRGCON1,5)
// CMCON<C1INV>
extern volatile __bit                   C1INV               __at(0x7DA4);	// @ (0xFB4 * 8 + 4)
#define                                 C1INV_bit           _BIT_ACCESS(CMCON,4)
// CMCON<C1OUT>
extern volatile __bit                   C1OUT               __at(0x7DA6);	// @ (0xFB4 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CMCON,6)
// PORTF<C1OUTF>
extern volatile __bit                   C1OUTF              __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 C1OUTF_bit          _BIT_ACCESS(PORTF,2)
// CMCON<C2INV>
extern volatile __bit                   C2INV               __at(0x7DA5);	// @ (0xFB4 * 8 + 5)
#define                                 C2INV_bit           _BIT_ACCESS(CMCON,5)
// CMCON<C2OUT>
extern volatile __bit                   C2OUT               __at(0x7DA7);	// @ (0xFB4 * 8 + 7)
#define                                 C2OUT_bit           _BIT_ACCESS(CMCON,7)
// PORTF<C2OUTF>
extern volatile __bit                   C2OUTF              __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 C2OUTF_bit          _BIT_ACCESS(PORTF,1)
// PORTG<C3OUTG>
extern volatile __bit                   C3OUTG              __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 C3OUTG_bit          _BIT_ACCESS(PORTG,1)
// CIOCON<CANCAP>
extern volatile __bit                   CANCAP              __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 CANCAP_bit          _BIT_ACCESS(CIOCON,4)
// PORTG<CANRX>
extern volatile __bit                   CANRX               __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 CANRX_bit           _BIT_ACCESS(PORTG,2)
// PORTG<CANTX1>
extern volatile __bit                   CANTX1              __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 CANTX1_bit          _BIT_ACCESS(PORTG,0)
// PORTG<CANTX2>
extern volatile __bit                   CANTX2              __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 CANTX2_bit          _BIT_ACCESS(PORTG,1)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PORTC<CCP1>
extern volatile __bit                   CCP1                __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CCP1_bit            _BIT_ACCESS(PORTC,2)
// PORTE<CCP10>
extern volatile __bit                   CCP10               __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CCP10_bit           _BIT_ACCESS(PORTE,2)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7CF2);	// @ (0xF9E * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// IPR1<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7CFA);	// @ (0xF9F * 8 + 2)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR1,2)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DE8);	// @ (0xFBD * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DE9);	// @ (0xFBD * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DEA);	// @ (0xFBD * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DEB);	// @ (0xFBD * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// PORTC<CCP2>
extern volatile __bit                   CCP2                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 CCP2_bit            _BIT_ACCESS(PORTC,1)
// PORTE<CCP2E>
extern volatile __bit                   CCP2E               __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 CCP2E_bit           _BIT_ACCESS(PORTE,7)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7D00);	// @ (0xFA0 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7D08);	// @ (0xFA1 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// IPR2<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7D10);	// @ (0xFA2 * 8 + 0)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR2,0)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x7DD1);	// @ (0xFBA * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x7DD2);	// @ (0xFBA * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x7DD3);	// @ (0xFBA * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// PORTH<CCP6>
extern volatile __bit                   CCP6                __at(0x7C3F);	// @ (0xF87 * 8 + 7)
#define                                 CCP6_bit            _BIT_ACCESS(PORTH,7)
// PORTE<CCP6E>
extern volatile __bit                   CCP6E               __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 CCP6E_bit           _BIT_ACCESS(PORTE,6)
// PORTH<CCP7>
extern volatile __bit                   CCP7                __at(0x7C3E);	// @ (0xF87 * 8 + 6)
#define                                 CCP7_bit            _BIT_ACCESS(PORTH,6)
// PORTE<CCP7E>
extern volatile __bit                   CCP7E               __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 CCP7E_bit           _BIT_ACCESS(PORTE,5)
// PORTH<CCP8>
extern volatile __bit                   CCP8                __at(0x7C3D);	// @ (0xF87 * 8 + 5)
#define                                 CCP8_bit            _BIT_ACCESS(PORTH,5)
// PORTE<CCP8E>
extern volatile __bit                   CCP8E               __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 CCP8E_bit           _BIT_ACCESS(PORTE,4)
// PORTH<CCP9>
extern volatile __bit                   CCP9                __at(0x7C3C);	// @ (0xF87 * 8 + 4)
#define                                 CCP9_bit            _BIT_ACCESS(PORTH,4)
// PORTE<CCP9E>
extern volatile __bit                   CCP9E               __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 CCP9E_bit           _BIT_ACCESS(PORTE,3)
// PORTJ<CE>
extern volatile __bit                   CE                  __at(0x7C45);	// @ (0xF88 * 8 + 5)
#define                                 CE_bit              _BIT_ACCESS(PORTJ,5)
// EECON1<CFGS>
extern volatile __bit                   CFGS                __at(0x7D36);	// @ (0xFA6 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(EECON1,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON1<CHSN3>
extern volatile __bit                   CHSN3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON1,3)
// CMCON<CIS>
extern volatile __bit                   CIS                 __at(0x7DA3);	// @ (0xFB4 * 8 + 3)
#define                                 CIS_bit             _BIT_ACCESS(CMCON,3)
// PORTC<CK>
