MikroElektronika/core_packages/PIC/XC8/def/PIC18F8585/mcu.h
extern volatile __bit                   F4BP_2              __at(0x6F12);	// @ (0xDE2 * 8 + 2)
#define                                 F4BP_2_bit          _BIT_ACCESS(RXFBCON2,2)
// RXFBCON2<F4BP_3>
extern volatile __bit                   F4BP_3              __at(0x6F13);	// @ (0xDE2 * 8 + 3)
#define                                 F4BP_3_bit          _BIT_ACCESS(RXFBCON2,3)
// RXFBCON2<F5BP_0>
extern volatile __bit                   F5BP_0              __at(0x6F14);	// @ (0xDE2 * 8 + 4)
#define                                 F5BP_0_bit          _BIT_ACCESS(RXFBCON2,4)
// RXFBCON2<F5BP_1>
extern volatile __bit                   F5BP_1              __at(0x6F15);	// @ (0xDE2 * 8 + 5)
#define                                 F5BP_1_bit          _BIT_ACCESS(RXFBCON2,5)
// RXFBCON2<F5BP_2>
extern volatile __bit                   F5BP_2              __at(0x6F16);	// @ (0xDE2 * 8 + 6)
#define                                 F5BP_2_bit          _BIT_ACCESS(RXFBCON2,6)
// RXFBCON2<F5BP_3>
extern volatile __bit                   F5BP_3              __at(0x6F17);	// @ (0xDE2 * 8 + 7)
#define                                 F5BP_3_bit          _BIT_ACCESS(RXFBCON2,7)
// RXFBCON3<F6BP_0>
extern volatile __bit                   F6BP_0              __at(0x6F18);	// @ (0xDE3 * 8 + 0)
#define                                 F6BP_0_bit          _BIT_ACCESS(RXFBCON3,0)
// RXFBCON3<F6BP_01>
extern volatile __bit                   F6BP_01             __at(0x6F18);	// @ (0xDE3 * 8 + 0)
#define                                 F6BP_01_bit         _BIT_ACCESS(RXFBCON3,0)
// RXFBCON3<F6BP_1>
extern volatile __bit                   F6BP_1              __at(0x6F19);	// @ (0xDE3 * 8 + 1)
#define                                 F6BP_1_bit          _BIT_ACCESS(RXFBCON3,1)
// RXFBCON3<F6BP_2>
extern volatile __bit                   F6BP_2              __at(0x6F1A);	// @ (0xDE3 * 8 + 2)
#define                                 F6BP_2_bit          _BIT_ACCESS(RXFBCON3,2)
// RXFBCON3<F6BP_3>
extern volatile __bit                   F6BP_3              __at(0x6F1B);	// @ (0xDE3 * 8 + 3)
#define                                 F6BP_3_bit          _BIT_ACCESS(RXFBCON3,3)
// RXFBCON3<F7BP_0>
extern volatile __bit                   F7BP_0              __at(0x6F1C);	// @ (0xDE3 * 8 + 4)
#define                                 F7BP_0_bit          _BIT_ACCESS(RXFBCON3,4)
// RXFBCON3<F7BP_1>
extern volatile __bit                   F7BP_1              __at(0x6F1D);	// @ (0xDE3 * 8 + 5)
#define                                 F7BP_1_bit          _BIT_ACCESS(RXFBCON3,5)
// RXFBCON3<F7BP_2>
extern volatile __bit                   F7BP_2              __at(0x6F1E);	// @ (0xDE3 * 8 + 6)
#define                                 F7BP_2_bit          _BIT_ACCESS(RXFBCON3,6)
// RXFBCON3<F7BP_3>
extern volatile __bit                   F7BP_3              __at(0x6F1F);	// @ (0xDE3 * 8 + 7)
#define                                 F7BP_3_bit          _BIT_ACCESS(RXFBCON3,7)
// RXFBCON4<F8BP_0>
extern volatile __bit                   F8BP_0              __at(0x6F20);	// @ (0xDE4 * 8 + 0)
#define                                 F8BP_0_bit          _BIT_ACCESS(RXFBCON4,0)
// RXFBCON4<F8BP_01>
extern volatile __bit                   F8BP_01             __at(0x6F20);	// @ (0xDE4 * 8 + 0)
#define                                 F8BP_01_bit         _BIT_ACCESS(RXFBCON4,0)
// RXFBCON4<F8BP_1>
extern volatile __bit                   F8BP_1              __at(0x6F21);	// @ (0xDE4 * 8 + 1)
#define                                 F8BP_1_bit          _BIT_ACCESS(RXFBCON4,1)
// RXFBCON4<F8BP_2>
extern volatile __bit                   F8BP_2              __at(0x6F22);	// @ (0xDE4 * 8 + 2)
#define                                 F8BP_2_bit          _BIT_ACCESS(RXFBCON4,2)
// RXFBCON4<F8BP_3>
extern volatile __bit                   F8BP_3              __at(0x6F23);	// @ (0xDE4 * 8 + 3)
#define                                 F8BP_3_bit          _BIT_ACCESS(RXFBCON4,3)
// RXFBCON4<F9BP_0>
extern volatile __bit                   F9BP_0              __at(0x6F24);	// @ (0xDE4 * 8 + 4)
#define                                 F9BP_0_bit          _BIT_ACCESS(RXFBCON4,4)
// RXFBCON4<F9BP_1>
extern volatile __bit                   F9BP_1              __at(0x6F25);	// @ (0xDE4 * 8 + 5)
#define                                 F9BP_1_bit          _BIT_ACCESS(RXFBCON4,5)
// RXFBCON4<F9BP_2>
extern volatile __bit                   F9BP_2              __at(0x6F26);	// @ (0xDE4 * 8 + 6)
#define                                 F9BP_2_bit          _BIT_ACCESS(RXFBCON4,6)
// RXFBCON4<F9BP_3>
extern volatile __bit                   F9BP_3              __at(0x6F27);	// @ (0xDE4 * 8 + 7)
#define                                 F9BP_3_bit          _BIT_ACCESS(RXFBCON4,7)
// RCSTA<FERR>
extern volatile __bit                   FERR                __at(0x7D5A);	// @ (0xFAB * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RCSTA,2)
// RCSTA<FERR1>
extern volatile __bit                   FERR1               __at(0x7D5A);	// @ (0xFAB * 8 + 2)
#define                                 FERR1_bit           _BIT_ACCESS(RCSTA,2)
// COMSTAT<FIFOEMPTY>
extern volatile __bit                   FIFOEMPTY           __at(0x7BA7);	// @ (0xF74 * 8 + 7)
#define                                 FIFOEMPTY_bit       _BIT_ACCESS(COMSTAT,7)
// ECANCON<FIFOWM>
extern volatile __bit                   FIFOWM              __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 FIFOWM_bit          _BIT_ACCESS(ECANCON,5)
// PIE3<FIFOWMIE>
extern volatile __bit                   FIFOWMIE            __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 FIFOWMIE_bit        _BIT_ACCESS(PIE3,0)
// PIR3<FIFOWMIF>
extern volatile __bit                   FIFOWMIF            __at(0x7D20);	// @ (0xFA4 * 8 + 0)
#define                                 FIFOWMIF_bit        _BIT_ACCESS(PIR3,0)
// IPR3<FIFOWMIP>
extern volatile __bit                   FIFOWMIP            __at(0x7D28);	// @ (0xFA5 * 8 + 0)
#define                                 FIFOWMIP_bit        _BIT_ACCESS(IPR3,0)
// MSEL0<FIL0_0>
extern volatile __bit                   FIL0_0              __at(0x6F80);	// @ (0xDF0 * 8 + 0)
#define                                 FIL0_0_bit          _BIT_ACCESS(MSEL0,0)
// MSEL0<FIL0_1>
extern volatile __bit                   FIL0_1              __at(0x6F81);	// @ (0xDF0 * 8 + 1)
#define                                 FIL0_1_bit          _BIT_ACCESS(MSEL0,1)
// MSEL2<FIL10_0>
extern volatile __bit                   FIL10_0             __at(0x6F94);	// @ (0xDF2 * 8 + 4)
#define                                 FIL10_0_bit         _BIT_ACCESS(MSEL2,4)
// MSEL2<FIL10_1>
extern volatile __bit                   FIL10_1             __at(0x6F95);	// @ (0xDF2 * 8 + 5)
#define                                 FIL10_1_bit         _BIT_ACCESS(MSEL2,5)
// MSEL2<FIL11_0>
extern volatile __bit                   FIL11_0             __at(0x6F96);	// @ (0xDF2 * 8 + 6)
#define                                 FIL11_0_bit         _BIT_ACCESS(MSEL2,6)
// MSEL2<FIL11_1>
extern volatile __bit                   FIL11_1             __at(0x6F97);	// @ (0xDF2 * 8 + 7)
#define                                 FIL11_1_bit         _BIT_ACCESS(MSEL2,7)
// MSEL3<FIL12_0>
extern volatile __bit                   FIL12_0             __at(0x6F98);	// @ (0xDF3 * 8 + 0)
#define                                 FIL12_0_bit         _BIT_ACCESS(MSEL3,0)
// MSEL3<FIL12_1>
extern volatile __bit                   FIL12_1             __at(0x6F99);	// @ (0xDF3 * 8 + 1)
#define                                 FIL12_1_bit         _BIT_ACCESS(MSEL3,1)
// MSEL3<FIL13_0>
extern volatile __bit                   FIL13_0             __at(0x6F9A);	// @ (0xDF3 * 8 + 2)
#define                                 FIL13_0_bit         _BIT_ACCESS(MSEL3,2)
// MSEL3<FIL13_1>
extern volatile __bit                   FIL13_1             __at(0x6F9B);	// @ (0xDF3 * 8 + 3)
#define                                 FIL13_1_bit         _BIT_ACCESS(MSEL3,3)
// MSEL3<FIL14_0>
extern volatile __bit                   FIL14_0             __at(0x6F9C);	// @ (0xDF3 * 8 + 4)
#define                                 FIL14_0_bit         _BIT_ACCESS(MSEL3,4)
// MSEL3<FIL14_1>
extern volatile __bit                   FIL14_1             __at(0x6F9D);	// @ (0xDF3 * 8 + 5)
#define                                 FIL14_1_bit         _BIT_ACCESS(MSEL3,5)
// MSEL3<FIL15_0>
extern volatile __bit                   FIL15_0             __at(0x6F9E);	// @ (0xDF3 * 8 + 6)
#define                                 FIL15_0_bit         _BIT_ACCESS(MSEL3,6)
// MSEL3<FIL15_1>
extern volatile __bit                   FIL15_1             __at(0x6F9F);	// @ (0xDF3 * 8 + 7)
#define                                 FIL15_1_bit         _BIT_ACCESS(MSEL3,7)
// MSEL0<FIL1_0>
extern volatile __bit                   FIL1_0              __at(0x6F82);	// @ (0xDF0 * 8 + 2)
#define                                 FIL1_0_bit          _BIT_ACCESS(MSEL0,2)
// MSEL0<FIL1_1>
extern volatile __bit                   FIL1_1              __at(0x6F83);	// @ (0xDF0 * 8 + 3)
#define                                 FIL1_1_bit          _BIT_ACCESS(MSEL0,3)
// MSEL0<FIL2_0>
extern volatile __bit                   FIL2_0              __at(0x6F84);	// @ (0xDF0 * 8 + 4)
#define                                 FIL2_0_bit          _BIT_ACCESS(MSEL0,4)
// MSEL0<FIL2_1>
extern volatile __bit                   FIL2_1              __at(0x6F85);	// @ (0xDF0 * 8 + 5)
#define                                 FIL2_1_bit          _BIT_ACCESS(MSEL0,5)
// MSEL0<FIL3_0>
extern volatile __bit                   FIL3_0              __at(0x6F86);	// @ (0xDF0 * 8 + 6)
#define                                 FIL3_0_bit          _BIT_ACCESS(MSEL0,6)
// MSEL0<FIL3_1>
extern volatile __bit                   FIL3_1              __at(0x6F87);	// @ (0xDF0 * 8 + 7)
#define                                 FIL3_1_bit          _BIT_ACCESS(MSEL0,7)
// MSEL1<FIL4_0>
extern volatile __bit                   FIL4_0              __at(0x6F88);	// @ (0xDF1 * 8 + 0)
#define                                 FIL4_0_bit          _BIT_ACCESS(MSEL1,0)
// MSEL1<FIL4_1>
extern volatile __bit                   FIL4_1              __at(0x6F89);	// @ (0xDF1 * 8 + 1)
#define                                 FIL4_1_bit          _BIT_ACCESS(MSEL1,1)
// MSEL1<FIL5_0>
extern volatile __bit                   FIL5_0              __at(0x6F8A);	// @ (0xDF1 * 8 + 2)
#define                                 FIL5_0_bit          _BIT_ACCESS(MSEL1,2)
// MSEL1<FIL5_1>
extern volatile __bit                   FIL5_1              __at(0x6F8B);	// @ (0xDF1 * 8 + 3)
#define                                 FIL5_1_bit          _BIT_ACCESS(MSEL1,3)
// MSEL1<FIL6_0>
extern volatile __bit                   FIL6_0              __at(0x6F8C);	// @ (0xDF1 * 8 + 4)
#define                                 FIL6_0_bit          _BIT_ACCESS(MSEL1,4)
// MSEL1<FIL6_1>
extern volatile __bit                   FIL6_1              __at(0x6F8D);	// @ (0xDF1 * 8 + 5)
#define                                 FIL6_1_bit          _BIT_ACCESS(MSEL1,5)
// MSEL1<FIL7_0>
extern volatile __bit                   FIL7_0              __at(0x6F8E);	// @ (0xDF1 * 8 + 6)
#define                                 FIL7_0_bit          _BIT_ACCESS(MSEL1,6)
// MSEL1<FIL7_1>
extern volatile __bit                   FIL7_1              __at(0x6F8F);	// @ (0xDF1 * 8 + 7)
#define                                 FIL7_1_bit          _BIT_ACCESS(MSEL1,7)
// MSEL2<FIL8_0>
extern volatile __bit                   FIL8_0              __at(0x6F90);	// @ (0xDF2 * 8 + 0)
#define                                 FIL8_0_bit          _BIT_ACCESS(MSEL2,0)
// MSEL2<FIL8_1>
extern volatile __bit                   FIL8_1              __at(0x6F91);	// @ (0xDF2 * 8 + 1)
#define                                 FIL8_1_bit          _BIT_ACCESS(MSEL2,1)
// MSEL2<FIL9_0>
extern volatile __bit                   FIL9_0              __at(0x6F92);	// @ (0xDF2 * 8 + 2)
#define                                 FIL9_0_bit          _BIT_ACCESS(MSEL2,2)
// MSEL2<FIL9_1>
extern volatile __bit                   FIL9_1              __at(0x6F93);	// @ (0xDF2 * 8 + 3)
#define                                 FIL9_1_bit          _BIT_ACCESS(MSEL2,3)
// CANCON<FP0>
extern volatile __bit _DEPRECATED       FP0                 __at(0x7B78);	// @ (0xF6F * 8 + 0)
#define                                 FP0_bit             _BIT_ACCESS(CANCON,0)
// CANCON<FP1>
extern volatile __bit                   FP1                 __at(0x7B79);	// @ (0xF6F * 8 + 1)
#define                                 FP1_bit             _BIT_ACCESS(CANCON,1)
// CANCON<FP2>
extern volatile __bit                   FP2                 __at(0x7B7A);	// @ (0xF6F * 8 + 2)
#define                                 FP2_bit             _BIT_ACCESS(CANCON,2)
// CANCON<FP3>
extern volatile __bit                   FP3                 __at(0x7B7B);	// @ (0xF6F * 8 + 3)
#define                                 FP3_bit             _BIT_ACCESS(CANCON,3)
// EECON1<FREE>
extern volatile __bit                   FREE                __at(0x7D34);	// @ (0xFA6 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(EECON1,4)
// SSPCON2<GCEN>
extern volatile __bit                   GCEN                __at(0x7E2F);	// @ (0xFC5 * 8 + 7)
#define                                 GCEN_bit            _BIT_ACCESS(SSPCON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// INTCON<GIEH>
extern volatile __bit                   GIEH                __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIEH_bit            _BIT_ACCESS(INTCON,7)
// INTCON<GIEL>
extern volatile __bit                   GIEL                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 GIEL_bit            _BIT_ACCESS(INTCON,6)
// INTCON<GIE_GIEH>
extern volatile __bit                   GIE_GIEH            __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIE_GIEH_bit        _BIT_ACCESS(INTCON,7)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// ADCON0<GODONE>
extern volatile __bit                   GODONE              __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GODONE_bit          _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_DONE>
extern volatile __bit                   GO_DONE             __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_DONE_bit         _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_NOT_DONE>
extern volatile __bit                   GO_NOT_DONE         __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_NOT_DONE_bit     _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// SSPSTAT<I2C_DAT>
extern volatile __bit                   I2C_DAT             __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 I2C_DAT_bit         _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<I2C_READ>
extern volatile __bit                   I2C_READ            __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 I2C_READ_bit        _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<I2C_START>
extern volatile __bit                   I2C_START           __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 I2C_START_bit       _BIT_ACCESS(SSPSTAT,3)
// SSPSTAT<I2C_STOP>
extern volatile __bit                   I2C_STOP            __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 I2C_STOP_bit        _BIT_ACCESS(SSPSTAT,4)
// PSPCON<IBF>
extern volatile __bit                   IBF                 __at(0x7D87);	// @ (0xFB0 * 8 + 7)
#define                                 IBF_bit             _BIT_ACCESS(PSPCON,7)
// PSPCON<IBOV>
extern volatile __bit                   IBOV                __at(0x7D85);	// @ (0xFB0 * 8 + 5)
#define                                 IBOV_bit            _BIT_ACCESS(PSPCON,5)
// CANSTAT<ICODE0>
extern volatile __bit                   ICODE0              __at(0x7B71);	// @ (0xF6E * 8 + 1)
#define                                 ICODE0_bit          _BIT_ACCESS(CANSTAT,1)
// CANSTAT<ICODE1>
extern volatile __bit                   ICODE1              __at(0x7B72);	// @ (0xF6E * 8 + 2)
#define                                 ICODE1_bit          _BIT_ACCESS(CANSTAT,2)
// CANSTAT<ICODE2>
extern volatile __bit                   ICODE2              __at(0x7B73);	// @ (0xF6E * 8 + 3)
#define                                 ICODE2_bit          _BIT_ACCESS(CANSTAT,3)
// PORTB<INT0>
extern volatile __bit                   INT0                __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 INT0_bit            _BIT_ACCESS(PORTB,0)
// INTCON<INT0E>
extern volatile __bit                   INT0E               __at(0x7F94);	// @ (0xFF2 * 8 + 4)
#define                                 INT0E_bit           _BIT_ACCESS(INTCON,4)
// INTCON<INT0F>
extern volatile __bit                   INT0F               __at(0x7F91);	// @ (0xFF2 * 8 + 1)
#define                                 INT0F_bit           _BIT_ACCESS(INTCON,1)
// INTCON<INT0IE>
extern volatile __bit                   INT0IE              __at(0x7F94);	// @ (0xFF2 * 8 + 4)
#define                                 INT0IE_bit          _BIT_ACCESS(INTCON,4)
// INTCON<INT0IF>
extern volatile __bit                   INT0IF              __at(0x7F91);	// @ (0xFF2 * 8 + 1)
#define                                 INT0IF_bit          _BIT_ACCESS(INTCON,1)
// PORTB<INT1>
extern volatile __bit                   INT1                __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 INT1_bit            _BIT_ACCESS(PORTB,1)
// INTCON3<INT1E>
extern volatile __bit                   INT1E               __at(0x7F83);	// @ (0xFF0 * 8 + 3)
#define                                 INT1E_bit           _BIT_ACCESS(INTCON3,3)
// INTCON3<INT1F>
extern volatile __bit                   INT1F               __at(0x7F80);	// @ (0xFF0 * 8 + 0)
#define                                 INT1F_bit           _BIT_ACCESS(INTCON3,0)
// INTCON3<INT1IE>
extern volatile __bit                   INT1IE              __at(0x7F83);	// @ (0xFF0 * 8 + 3)
#define                                 INT1IE_bit          _BIT_ACCESS(INTCON3,3)
// INTCON3<INT1IF>
extern volatile __bit                   INT1IF              __at(0x7F80);	// @ (0xFF0 * 8 + 0)
#define                                 INT1IF_bit          _BIT_ACCESS(INTCON3,0)
// INTCON3<INT1IP>
extern volatile __bit                   INT1IP              __at(0x7F86);	// @ (0xFF0 * 8 + 6)
#define                                 INT1IP_bit          _BIT_ACCESS(INTCON3,6)
// INTCON3<INT1P>
extern volatile __bit                   INT1P               __at(0x7F86);	// @ (0xFF0 * 8 + 6)
#define                                 INT1P_bit           _BIT_ACCESS(INTCON3,6)
// PORTB<INT2>
extern volatile __bit                   INT2                __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 INT2_bit            _BIT_ACCESS(PORTB,2)
// INTCON3<INT2E>
extern volatile __bit                   INT2E               __at(0x7F84);	// @ (0xFF0 * 8 + 4)
#define                                 INT2E_bit           _BIT_ACCESS(INTCON3,4)
// INTCON3<INT2F>
extern volatile __bit                   INT2F               __at(0x7F81);	// @ (0xFF0 * 8 + 1)
#define                                 INT2F_bit           _BIT_ACCESS(INTCON3,1)
// INTCON3<INT2IE>
extern volatile __bit                   INT2IE              __at(0x7F84);	// @ (0xFF0 * 8 + 4)
#define                                 INT2IE_bit          _BIT_ACCESS(INTCON3,4)
// INTCON3<INT2IF>
extern volatile __bit                   INT2IF              __at(0x7F81);	// @ (0xFF0 * 8 + 1)
#define                                 INT2IF_bit          _BIT_ACCESS(INTCON3,1)
// INTCON3<INT2IP>
extern volatile __bit                   INT2IP              __at(0x7F87);	// @ (0xFF0 * 8 + 7)
#define                                 INT2IP_bit          _BIT_ACCESS(INTCON3,7)
// INTCON3<INT2P>
extern volatile __bit                   INT2P               __at(0x7F87);	// @ (0xFF0 * 8 + 7)
#define                                 INT2P_bit           _BIT_ACCESS(INTCON3,7)
// PORTB<INT3>
extern volatile __bit                   INT3                __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 INT3_bit            _BIT_ACCESS(PORTB,3)
// INTCON3<INT3E>
extern volatile __bit                   INT3E               __at(0x7F85);	// @ (0xFF0 * 8 + 5)
#define                                 INT3E_bit           _BIT_ACCESS(INTCON3,5)
// INTCON3<INT3F>
extern volatile __bit                   INT3F               __at(0x7F82);	// @ (0xFF0 * 8 + 2)
#define                                 INT3F_bit           _BIT_ACCESS(INTCON3,2)
// INTCON3<INT3IE>
extern volatile __bit                   INT3IE              __at(0x7F85);	// @ (0xFF0 * 8 + 5)
#define                                 INT3IE_bit          _BIT_ACCESS(INTCON3,5)
// INTCON3<INT3IF>
extern volatile __bit                   INT3IF              __at(0x7F82);	// @ (0xFF0 * 8 + 2)
#define                                 INT3IF_bit          _BIT_ACCESS(INTCON3,2)
// INTCON2<INT3IP>
extern volatile __bit                   INT3IP              __at(0x7F89);	// @ (0xFF1 * 8 + 1)
#define                                 INT3IP_bit          _BIT_ACCESS(INTCON2,1)
// INTCON2<INT3P>
extern volatile __bit                   INT3P               __at(0x7F89);	// @ (0xFF1 * 8 + 1)
#define                                 INT3P_bit           _BIT_ACCESS(INTCON2,1)
// INTCON2<INTEDG0>
extern volatile __bit                   INTEDG0             __at(0x7F8E);	// @ (0xFF1 * 8 + 6)
#define                                 INTEDG0_bit         _BIT_ACCESS(INTCON2,6)
// INTCON2<INTEDG1>
extern volatile __bit                   INTEDG1             __at(0x7F8D);	// @ (0xFF1 * 8 + 5)
#define                                 INTEDG1_bit         _BIT_ACCESS(INTCON2,5)
// INTCON2<INTEDG2>
extern volatile __bit                   INTEDG2             __at(0x7F8C);	// @ (0xFF1 * 8 + 4)
#define                                 INTEDG2_bit         _BIT_ACCESS(INTCON2,4)
// INTCON2<INTEDG3>
extern volatile __bit                   INTEDG3             __at(0x7F8B);	// @ (0xFF1 * 8 + 3)
#define                                 INTEDG3_bit         _BIT_ACCESS(INTCON2,3)
// RCON<IPEN>
extern volatile __bit                   IPEN                __at(0x7E87);	// @ (0xFD0 * 8 + 7)
#define                                 IPEN_bit            _BIT_ACCESS(RCON,7)
// LVDCON<IRVST>
extern volatile __bit                   IRVST               __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 IRVST_bit           _BIT_ACCESS(LVDCON,5)
// PIE3<IRXIE>
extern volatile __bit                   IRXIE               __at(0x7D1F);	// @ (0xFA3 * 8 + 7)
#define                                 IRXIE_bit           _BIT_ACCESS(PIE3,7)
// PIR3<IRXIF>
extern volatile __bit                   IRXIF               __at(0x7D27);	// @ (0xFA4 * 8 + 7)
#define                                 IRXIF_bit           _BIT_ACCESS(PIR3,7)
// IPR3<IRXIP>
extern volatile __bit                   IRXIP               __at(0x7D2F);	// @ (0xFA5 * 8 + 7)
#define                                 IRXIP_bit           _BIT_ACCESS(IPR3,7)
// RXB0CON<JTOFF>
extern volatile __bit                   JTOFF               __at(0x7B01);	// @ (0xF60 * 8 + 1)
