MikroElektronika/core_packages/PIC/XC8/def/PIC18F8585/mcu.h
#define                                 RXF2EID2_bit        _BIT_ACCESS(RXF2EIDL,2)
// RXF2EIDL<RXF2EID3>
extern volatile __bit                   RXF2EID3            __at(0x785B);	// @ (0xF0B * 8 + 3)
#define                                 RXF2EID3_bit        _BIT_ACCESS(RXF2EIDL,3)
// RXF2EIDL<RXF2EID4>
extern volatile __bit                   RXF2EID4            __at(0x785C);	// @ (0xF0B * 8 + 4)
#define                                 RXF2EID4_bit        _BIT_ACCESS(RXF2EIDL,4)
// RXF2EIDL<RXF2EID5>
extern volatile __bit                   RXF2EID5            __at(0x785D);	// @ (0xF0B * 8 + 5)
#define                                 RXF2EID5_bit        _BIT_ACCESS(RXF2EIDL,5)
// RXF2EIDL<RXF2EID6>
extern volatile __bit                   RXF2EID6            __at(0x785E);	// @ (0xF0B * 8 + 6)
#define                                 RXF2EID6_bit        _BIT_ACCESS(RXF2EIDL,6)
// RXF2EIDL<RXF2EID7>
extern volatile __bit                   RXF2EID7            __at(0x785F);	// @ (0xF0B * 8 + 7)
#define                                 RXF2EID7_bit        _BIT_ACCESS(RXF2EIDL,7)
// RXF2EIDH<RXF2EID8>
extern volatile __bit                   RXF2EID8            __at(0x7850);	// @ (0xF0A * 8 + 0)
#define                                 RXF2EID8_bit        _BIT_ACCESS(RXF2EIDH,0)
// RXF2EIDH<RXF2EID9>
extern volatile __bit                   RXF2EID9            __at(0x7851);	// @ (0xF0A * 8 + 1)
#define                                 RXF2EID9_bit        _BIT_ACCESS(RXF2EIDH,1)
// RXFCON0<RXF2EN>
extern volatile __bit                   RXF2EN              __at(0x6EA2);	// @ (0xDD4 * 8 + 2)
#define                                 RXF2EN_bit          _BIT_ACCESS(RXFCON0,2)
// RXF2SIDL<RXF2EXIDEN>
extern volatile __bit                   RXF2EXIDEN          __at(0x784B);	// @ (0xF09 * 8 + 3)
#define                                 RXF2EXIDEN_bit      _BIT_ACCESS(RXF2SIDL,3)
// RXF2SIDL<RXF2SID0>
extern volatile __bit                   RXF2SID0            __at(0x784D);	// @ (0xF09 * 8 + 5)
#define                                 RXF2SID0_bit        _BIT_ACCESS(RXF2SIDL,5)
// RXF2SIDL<RXF2SID1>
extern volatile __bit                   RXF2SID1            __at(0x784E);	// @ (0xF09 * 8 + 6)
#define                                 RXF2SID1_bit        _BIT_ACCESS(RXF2SIDL,6)
// RXF2SIDH<RXF2SID10>
extern volatile __bit                   RXF2SID10           __at(0x7847);	// @ (0xF08 * 8 + 7)
#define                                 RXF2SID10_bit       _BIT_ACCESS(RXF2SIDH,7)
// RXF2SIDL<RXF2SID2>
extern volatile __bit                   RXF2SID2            __at(0x784F);	// @ (0xF09 * 8 + 7)
#define                                 RXF2SID2_bit        _BIT_ACCESS(RXF2SIDL,7)
// RXF2SIDH<RXF2SID3>
extern volatile __bit                   RXF2SID3            __at(0x7840);	// @ (0xF08 * 8 + 0)
#define                                 RXF2SID3_bit        _BIT_ACCESS(RXF2SIDH,0)
// RXF2SIDH<RXF2SID4>
extern volatile __bit                   RXF2SID4            __at(0x7841);	// @ (0xF08 * 8 + 1)
#define                                 RXF2SID4_bit        _BIT_ACCESS(RXF2SIDH,1)
// RXF2SIDH<RXF2SID5>
extern volatile __bit                   RXF2SID5            __at(0x7842);	// @ (0xF08 * 8 + 2)
#define                                 RXF2SID5_bit        _BIT_ACCESS(RXF2SIDH,2)
// RXF2SIDH<RXF2SID6>
extern volatile __bit                   RXF2SID6            __at(0x7843);	// @ (0xF08 * 8 + 3)
#define                                 RXF2SID6_bit        _BIT_ACCESS(RXF2SIDH,3)
// RXF2SIDH<RXF2SID7>
extern volatile __bit                   RXF2SID7            __at(0x7844);	// @ (0xF08 * 8 + 4)
#define                                 RXF2SID7_bit        _BIT_ACCESS(RXF2SIDH,4)
// RXF2SIDH<RXF2SID8>
extern volatile __bit                   RXF2SID8            __at(0x7845);	// @ (0xF08 * 8 + 5)
#define                                 RXF2SID8_bit        _BIT_ACCESS(RXF2SIDH,5)
// RXF2SIDH<RXF2SID9>
extern volatile __bit                   RXF2SID9            __at(0x7846);	// @ (0xF08 * 8 + 6)
#define                                 RXF2SID9_bit        _BIT_ACCESS(RXF2SIDH,6)
// RXF3EIDL<RXF3EID0>
extern volatile __bit                   RXF3EID0            __at(0x7878);	// @ (0xF0F * 8 + 0)
#define                                 RXF3EID0_bit        _BIT_ACCESS(RXF3EIDL,0)
// RXF3EIDL<RXF3EID1>
extern volatile __bit                   RXF3EID1            __at(0x7879);	// @ (0xF0F * 8 + 1)
#define                                 RXF3EID1_bit        _BIT_ACCESS(RXF3EIDL,1)
// RXF3EIDH<RXF3EID10>
extern volatile __bit                   RXF3EID10           __at(0x7872);	// @ (0xF0E * 8 + 2)
#define                                 RXF3EID10_bit       _BIT_ACCESS(RXF3EIDH,2)
// RXF3EIDH<RXF3EID11>
extern volatile __bit                   RXF3EID11           __at(0x7873);	// @ (0xF0E * 8 + 3)
#define                                 RXF3EID11_bit       _BIT_ACCESS(RXF3EIDH,3)
// RXF3EIDH<RXF3EID12>
extern volatile __bit                   RXF3EID12           __at(0x7874);	// @ (0xF0E * 8 + 4)
#define                                 RXF3EID12_bit       _BIT_ACCESS(RXF3EIDH,4)
// RXF3EIDH<RXF3EID13>
extern volatile __bit                   RXF3EID13           __at(0x7875);	// @ (0xF0E * 8 + 5)
#define                                 RXF3EID13_bit       _BIT_ACCESS(RXF3EIDH,5)
// RXF3EIDH<RXF3EID14>
extern volatile __bit                   RXF3EID14           __at(0x7876);	// @ (0xF0E * 8 + 6)
#define                                 RXF3EID14_bit       _BIT_ACCESS(RXF3EIDH,6)
// RXF3EIDH<RXF3EID15>
extern volatile __bit                   RXF3EID15           __at(0x7877);	// @ (0xF0E * 8 + 7)
#define                                 RXF3EID15_bit       _BIT_ACCESS(RXF3EIDH,7)
// RXF3SIDL<RXF3EID16>
extern volatile __bit                   RXF3EID16           __at(0x7868);	// @ (0xF0D * 8 + 0)
#define                                 RXF3EID16_bit       _BIT_ACCESS(RXF3SIDL,0)
// RXF3SIDL<RXF3EID17>
extern volatile __bit                   RXF3EID17           __at(0x7869);	// @ (0xF0D * 8 + 1)
#define                                 RXF3EID17_bit       _BIT_ACCESS(RXF3SIDL,1)
// RXF3EIDL<RXF3EID2>
extern volatile __bit                   RXF3EID2            __at(0x787A);	// @ (0xF0F * 8 + 2)
#define                                 RXF3EID2_bit        _BIT_ACCESS(RXF3EIDL,2)
// RXF3EIDL<RXF3EID3>
extern volatile __bit                   RXF3EID3            __at(0x787B);	// @ (0xF0F * 8 + 3)
#define                                 RXF3EID3_bit        _BIT_ACCESS(RXF3EIDL,3)
// RXF3EIDL<RXF3EID4>
extern volatile __bit                   RXF3EID4            __at(0x787C);	// @ (0xF0F * 8 + 4)
#define                                 RXF3EID4_bit        _BIT_ACCESS(RXF3EIDL,4)
// RXF3EIDL<RXF3EID5>
extern volatile __bit                   RXF3EID5            __at(0x787D);	// @ (0xF0F * 8 + 5)
#define                                 RXF3EID5_bit        _BIT_ACCESS(RXF3EIDL,5)
// RXF3EIDL<RXF3EID6>
extern volatile __bit                   RXF3EID6            __at(0x787E);	// @ (0xF0F * 8 + 6)
#define                                 RXF3EID6_bit        _BIT_ACCESS(RXF3EIDL,6)
// RXF3EIDL<RXF3EID7>
extern volatile __bit                   RXF3EID7            __at(0x787F);	// @ (0xF0F * 8 + 7)
#define                                 RXF3EID7_bit        _BIT_ACCESS(RXF3EIDL,7)
// RXF3EIDH<RXF3EID8>
extern volatile __bit                   RXF3EID8            __at(0x7870);	// @ (0xF0E * 8 + 0)
#define                                 RXF3EID8_bit        _BIT_ACCESS(RXF3EIDH,0)
// RXF3EIDH<RXF3EID9>
extern volatile __bit                   RXF3EID9            __at(0x7871);	// @ (0xF0E * 8 + 1)
#define                                 RXF3EID9_bit        _BIT_ACCESS(RXF3EIDH,1)
// RXFCON0<RXF3EN>
extern volatile __bit                   RXF3EN              __at(0x6EA3);	// @ (0xDD4 * 8 + 3)
#define                                 RXF3EN_bit          _BIT_ACCESS(RXFCON0,3)
// RXF3SIDL<RXF3EXIDEN>
extern volatile __bit                   RXF3EXIDEN          __at(0x786B);	// @ (0xF0D * 8 + 3)
#define                                 RXF3EXIDEN_bit      _BIT_ACCESS(RXF3SIDL,3)
// RXF3SIDL<RXF3SID0>
extern volatile __bit                   RXF3SID0            __at(0x786D);	// @ (0xF0D * 8 + 5)
#define                                 RXF3SID0_bit        _BIT_ACCESS(RXF3SIDL,5)
// RXF3SIDL<RXF3SID1>
extern volatile __bit                   RXF3SID1            __at(0x786E);	// @ (0xF0D * 8 + 6)
#define                                 RXF3SID1_bit        _BIT_ACCESS(RXF3SIDL,6)
// RXF3SIDH<RXF3SID10>
extern volatile __bit                   RXF3SID10           __at(0x7867);	// @ (0xF0C * 8 + 7)
#define                                 RXF3SID10_bit       _BIT_ACCESS(RXF3SIDH,7)
// RXF3SIDL<RXF3SID2>
extern volatile __bit                   RXF3SID2            __at(0x786F);	// @ (0xF0D * 8 + 7)
#define                                 RXF3SID2_bit        _BIT_ACCESS(RXF3SIDL,7)
// RXF3SIDH<RXF3SID3>
extern volatile __bit                   RXF3SID3            __at(0x7860);	// @ (0xF0C * 8 + 0)
#define                                 RXF3SID3_bit        _BIT_ACCESS(RXF3SIDH,0)
// RXF3SIDH<RXF3SID4>
extern volatile __bit                   RXF3SID4            __at(0x7861);	// @ (0xF0C * 8 + 1)
#define                                 RXF3SID4_bit        _BIT_ACCESS(RXF3SIDH,1)
// RXF3SIDH<RXF3SID5>
extern volatile __bit                   RXF3SID5            __at(0x7862);	// @ (0xF0C * 8 + 2)
#define                                 RXF3SID5_bit        _BIT_ACCESS(RXF3SIDH,2)
// RXF3SIDH<RXF3SID6>
extern volatile __bit                   RXF3SID6            __at(0x7863);	// @ (0xF0C * 8 + 3)
#define                                 RXF3SID6_bit        _BIT_ACCESS(RXF3SIDH,3)
// RXF3SIDH<RXF3SID7>
extern volatile __bit                   RXF3SID7            __at(0x7864);	// @ (0xF0C * 8 + 4)
#define                                 RXF3SID7_bit        _BIT_ACCESS(RXF3SIDH,4)
// RXF3SIDH<RXF3SID8>
extern volatile __bit                   RXF3SID8            __at(0x7865);	// @ (0xF0C * 8 + 5)
#define                                 RXF3SID8_bit        _BIT_ACCESS(RXF3SIDH,5)
// RXF3SIDH<RXF3SID9>
extern volatile __bit                   RXF3SID9            __at(0x7866);	// @ (0xF0C * 8 + 6)
#define                                 RXF3SID9_bit        _BIT_ACCESS(RXF3SIDH,6)
// RXF4EIDL<RXF4EID0>
extern volatile __bit                   RXF4EID0            __at(0x7898);	// @ (0xF13 * 8 + 0)
#define                                 RXF4EID0_bit        _BIT_ACCESS(RXF4EIDL,0)
// RXF4EIDL<RXF4EID1>
extern volatile __bit                   RXF4EID1            __at(0x7899);	// @ (0xF13 * 8 + 1)
#define                                 RXF4EID1_bit        _BIT_ACCESS(RXF4EIDL,1)
// RXF4EIDH<RXF4EID10>
extern volatile __bit                   RXF4EID10           __at(0x7892);	// @ (0xF12 * 8 + 2)
#define                                 RXF4EID10_bit       _BIT_ACCESS(RXF4EIDH,2)
// RXF4EIDH<RXF4EID11>
extern volatile __bit                   RXF4EID11           __at(0x7893);	// @ (0xF12 * 8 + 3)
#define                                 RXF4EID11_bit       _BIT_ACCESS(RXF4EIDH,3)
// RXF4EIDH<RXF4EID12>
extern volatile __bit                   RXF4EID12           __at(0x7894);	// @ (0xF12 * 8 + 4)
#define                                 RXF4EID12_bit       _BIT_ACCESS(RXF4EIDH,4)
// RXF4EIDH<RXF4EID13>
extern volatile __bit                   RXF4EID13           __at(0x7895);	// @ (0xF12 * 8 + 5)
#define                                 RXF4EID13_bit       _BIT_ACCESS(RXF4EIDH,5)
// RXF4EIDH<RXF4EID14>
extern volatile __bit                   RXF4EID14           __at(0x7896);	// @ (0xF12 * 8 + 6)
#define                                 RXF4EID14_bit       _BIT_ACCESS(RXF4EIDH,6)
// RXF4EIDH<RXF4EID15>
extern volatile __bit                   RXF4EID15           __at(0x7897);	// @ (0xF12 * 8 + 7)
#define                                 RXF4EID15_bit       _BIT_ACCESS(RXF4EIDH,7)
// RXF4SIDL<RXF4EID16>
extern volatile __bit                   RXF4EID16           __at(0x7888);	// @ (0xF11 * 8 + 0)
#define                                 RXF4EID16_bit       _BIT_ACCESS(RXF4SIDL,0)
// RXF4SIDL<RXF4EID17>
extern volatile __bit                   RXF4EID17           __at(0x7889);	// @ (0xF11 * 8 + 1)
#define                                 RXF4EID17_bit       _BIT_ACCESS(RXF4SIDL,1)
// RXF4EIDL<RXF4EID2>
extern volatile __bit                   RXF4EID2            __at(0x789A);	// @ (0xF13 * 8 + 2)
#define                                 RXF4EID2_bit        _BIT_ACCESS(RXF4EIDL,2)
// RXF4EIDL<RXF4EID3>
extern volatile __bit                   RXF4EID3            __at(0x789B);	// @ (0xF13 * 8 + 3)
#define                                 RXF4EID3_bit        _BIT_ACCESS(RXF4EIDL,3)
// RXF4EIDL<RXF4EID4>
extern volatile __bit                   RXF4EID4            __at(0x789C);	// @ (0xF13 * 8 + 4)
#define                                 RXF4EID4_bit        _BIT_ACCESS(RXF4EIDL,4)
// RXF4EIDL<RXF4EID5>
extern volatile __bit                   RXF4EID5            __at(0x789D);	// @ (0xF13 * 8 + 5)
#define                                 RXF4EID5_bit        _BIT_ACCESS(RXF4EIDL,5)
// RXF4EIDL<RXF4EID6>
extern volatile __bit                   RXF4EID6            __at(0x789E);	// @ (0xF13 * 8 + 6)
#define                                 RXF4EID6_bit        _BIT_ACCESS(RXF4EIDL,6)
// RXF4EIDL<RXF4EID7>
extern volatile __bit                   RXF4EID7            __at(0x789F);	// @ (0xF13 * 8 + 7)
#define                                 RXF4EID7_bit        _BIT_ACCESS(RXF4EIDL,7)
// RXF4EIDH<RXF4EID8>
extern volatile __bit                   RXF4EID8            __at(0x7890);	// @ (0xF12 * 8 + 0)
#define                                 RXF4EID8_bit        _BIT_ACCESS(RXF4EIDH,0)
// RXF4EIDH<RXF4EID9>
extern volatile __bit                   RXF4EID9            __at(0x7891);	// @ (0xF12 * 8 + 1)
#define                                 RXF4EID9_bit        _BIT_ACCESS(RXF4EIDH,1)
// RXFCON0<RXF4EN>
extern volatile __bit                   RXF4EN              __at(0x6EA4);	// @ (0xDD4 * 8 + 4)
#define                                 RXF4EN_bit          _BIT_ACCESS(RXFCON0,4)
// RXF4SIDL<RXF4EXIDEN>
extern volatile __bit                   RXF4EXIDEN          __at(0x788B);	// @ (0xF11 * 8 + 3)
#define                                 RXF4EXIDEN_bit      _BIT_ACCESS(RXF4SIDL,3)
// RXF4SIDL<RXF4SID0>
extern volatile __bit                   RXF4SID0            __at(0x788D);	// @ (0xF11 * 8 + 5)
#define                                 RXF4SID0_bit        _BIT_ACCESS(RXF4SIDL,5)
// RXF4SIDL<RXF4SID1>
extern volatile __bit                   RXF4SID1            __at(0x788E);	// @ (0xF11 * 8 + 6)
#define                                 RXF4SID1_bit        _BIT_ACCESS(RXF4SIDL,6)
// RXF4SIDH<RXF4SID10>
extern volatile __bit                   RXF4SID10           __at(0x7887);	// @ (0xF10 * 8 + 7)
#define                                 RXF4SID10_bit       _BIT_ACCESS(RXF4SIDH,7)
// RXF4SIDL<RXF4SID2>
extern volatile __bit                   RXF4SID2            __at(0x788F);	// @ (0xF11 * 8 + 7)
#define                                 RXF4SID2_bit        _BIT_ACCESS(RXF4SIDL,7)
// RXF4SIDH<RXF4SID3>
extern volatile __bit                   RXF4SID3            __at(0x7880);	// @ (0xF10 * 8 + 0)
#define                                 RXF4SID3_bit        _BIT_ACCESS(RXF4SIDH,0)
// RXF4SIDH<RXF4SID4>
extern volatile __bit                   RXF4SID4            __at(0x7881);	// @ (0xF10 * 8 + 1)
#define                                 RXF4SID4_bit        _BIT_ACCESS(RXF4SIDH,1)
// RXF4SIDH<RXF4SID5>
extern volatile __bit                   RXF4SID5            __at(0x7882);	// @ (0xF10 * 8 + 2)
#define                                 RXF4SID5_bit        _BIT_ACCESS(RXF4SIDH,2)
// RXF4SIDH<RXF4SID6>
extern volatile __bit                   RXF4SID6            __at(0x7883);	// @ (0xF10 * 8 + 3)
#define                                 RXF4SID6_bit        _BIT_ACCESS(RXF4SIDH,3)
// RXF4SIDH<RXF4SID7>
extern volatile __bit                   RXF4SID7            __at(0x7884);	// @ (0xF10 * 8 + 4)
#define                                 RXF4SID7_bit        _BIT_ACCESS(RXF4SIDH,4)
// RXF4SIDH<RXF4SID8>
extern volatile __bit                   RXF4SID8            __at(0x7885);	// @ (0xF10 * 8 + 5)
#define                                 RXF4SID8_bit        _BIT_ACCESS(RXF4SIDH,5)
// RXF4SIDH<RXF4SID9>
extern volatile __bit                   RXF4SID9            __at(0x7886);	// @ (0xF10 * 8 + 6)
#define                                 RXF4SID9_bit        _BIT_ACCESS(RXF4SIDH,6)
// RXF5EIDL<RXF5EID0>
extern volatile __bit                   RXF5EID0            __at(0x78B8);	// @ (0xF17 * 8 + 0)
#define                                 RXF5EID0_bit        _BIT_ACCESS(RXF5EIDL,0)
// RXF5EIDL<RXF5EID1>
extern volatile __bit                   RXF5EID1            __at(0x78B9);	// @ (0xF17 * 8 + 1)
#define                                 RXF5EID1_bit        _BIT_ACCESS(RXF5EIDL,1)
// RXF5EIDH<RXF5EID10>
extern volatile __bit                   RXF5EID10           __at(0x78B2);	// @ (0xF16 * 8 + 2)
#define                                 RXF5EID10_bit       _BIT_ACCESS(RXF5EIDH,2)
// RXF5EIDH<RXF5EID11>
extern volatile __bit                   RXF5EID11           __at(0x78B3);	// @ (0xF16 * 8 + 3)
#define                                 RXF5EID11_bit       _BIT_ACCESS(RXF5EIDH,3)
// RXF5EIDH<RXF5EID12>
extern volatile __bit                   RXF5EID12           __at(0x78B4);	// @ (0xF16 * 8 + 4)
#define                                 RXF5EID12_bit       _BIT_ACCESS(RXF5EIDH,4)
// RXF5EIDH<RXF5EID13>
extern volatile __bit                   RXF5EID13           __at(0x78B5);	// @ (0xF16 * 8 + 5)
#define                                 RXF5EID13_bit       _BIT_ACCESS(RXF5EIDH,5)
// RXF5EIDH<RXF5EID14>
extern volatile __bit                   RXF5EID14           __at(0x78B6);	// @ (0xF16 * 8 + 6)
#define                                 RXF5EID14_bit       _BIT_ACCESS(RXF5EIDH,6)
// RXF5EIDH<RXF5EID15>
extern volatile __bit                   RXF5EID15           __at(0x78B7);	// @ (0xF16 * 8 + 7)
#define                                 RXF5EID15_bit       _BIT_ACCESS(RXF5EIDH,7)
// RXF5SIDL<RXF5EID16>
extern volatile __bit                   RXF5EID16           __at(0x78A8);	// @ (0xF15 * 8 + 0)
#define                                 RXF5EID16_bit       _BIT_ACCESS(RXF5SIDL,0)
// RXF5SIDL<RXF5EID17>
extern volatile __bit                   RXF5EID17           __at(0x78A9);	// @ (0xF15 * 8 + 1)
#define                                 RXF5EID17_bit       _BIT_ACCESS(RXF5SIDL,1)
// RXF5EIDL<RXF5EID2>
extern volatile __bit                   RXF5EID2            __at(0x78BA);	// @ (0xF17 * 8 + 2)
#define                                 RXF5EID2_bit        _BIT_ACCESS(RXF5EIDL,2)
// RXF5EIDL<RXF5EID3>
extern volatile __bit                   RXF5EID3            __at(0x78BB);	// @ (0xF17 * 8 + 3)
#define                                 RXF5EID3_bit        _BIT_ACCESS(RXF5EIDL,3)
// RXF5EIDL<RXF5EID4>
extern volatile __bit                   RXF5EID4            __at(0x78BC);	// @ (0xF17 * 8 + 4)
#define                                 RXF5EID4_bit        _BIT_ACCESS(RXF5EIDL,4)
// RXF5EIDL<RXF5EID5>
extern volatile __bit                   RXF5EID5            __at(0x78BD);	// @ (0xF17 * 8 + 5)
#define                                 RXF5EID5_bit        _BIT_ACCESS(RXF5EIDL,5)
// RXF5EIDL<RXF5EID6>
extern volatile __bit                   RXF5EID6            __at(0x78BE);	// @ (0xF17 * 8 + 6)
#define                                 RXF5EID6_bit        _BIT_ACCESS(RXF5EIDL,6)
// RXF5EIDL<RXF5EID7>
extern volatile __bit                   RXF5EID7            __at(0x78BF);	// @ (0xF17 * 8 + 7)
#define                                 RXF5EID7_bit        _BIT_ACCESS(RXF5EIDL,7)
// RXF5EIDH<RXF5EID8>
extern volatile __bit                   RXF5EID8            __at(0x78B0);	// @ (0xF16 * 8 + 0)
#define                                 RXF5EID8_bit        _BIT_ACCESS(RXF5EIDH,0)
// RXF5EIDH<RXF5EID9>
extern volatile __bit                   RXF5EID9            __at(0x78B1);	// @ (0xF16 * 8 + 1)
#define                                 RXF5EID9_bit        _BIT_ACCESS(RXF5EIDH,1)
// RXFCON0<RXF5EN>
extern volatile __bit                   RXF5EN              __at(0x6EA5);	// @ (0xDD4 * 8 + 5)
#define                                 RXF5EN_bit          _BIT_ACCESS(RXFCON0,5)
// RXF5SIDL<RXF5EXIDEN>
extern volatile __bit                   RXF5EXIDEN          __at(0x78AB);	// @ (0xF15 * 8 + 3)
#define                                 RXF5EXIDEN_bit      _BIT_ACCESS(RXF5SIDL,3)
// RXF5SIDL<RXF5SID0>
extern volatile __bit                   RXF5SID0            __at(0x78AD);	// @ (0xF15 * 8 + 5)
#define                                 RXF5SID0_bit        _BIT_ACCESS(RXF5SIDL,5)
// RXF5SIDL<RXF5SID1>
extern volatile __bit                   RXF5SID1            __at(0x78AE);	// @ (0xF15 * 8 + 6)
#define                                 RXF5SID1_bit        _BIT_ACCESS(RXF5SIDL,6)
// RXF5SIDH<RXF5SID10>
extern volatile __bit                   RXF5SID10           __at(0x78A7);	// @ (0xF14 * 8 + 7)
#define                                 RXF5SID10_bit       _BIT_ACCESS(RXF5SIDH,7)
// RXF5SIDL<RXF5SID2>
extern volatile __bit                   RXF5SID2            __at(0x78AF);	// @ (0xF15 * 8 + 7)
#define                                 RXF5SID2_bit        _BIT_ACCESS(RXF5SIDL,7)
// RXF5SIDH<RXF5SID3>
extern volatile __bit                   RXF5SID3            __at(0x78A0);	// @ (0xF14 * 8 + 0)
#define                                 RXF5SID3_bit        _BIT_ACCESS(RXF5SIDH,0)
// RXF5SIDH<RXF5SID4>
extern volatile __bit                   RXF5SID4            __at(0x78A1);	// @ (0xF14 * 8 + 1)
#define                                 RXF5SID4_bit        _BIT_ACCESS(RXF5SIDH,1)
// RXF5SIDH<RXF5SID5>
extern volatile __bit                   RXF5SID5            __at(0x78A2);	// @ (0xF14 * 8 + 2)
#define                                 RXF5SID5_bit        _BIT_ACCESS(RXF5SIDH,2)
// RXF5SIDH<RXF5SID6>
extern volatile __bit                   RXF5SID6            __at(0x78A3);	// @ (0xF14 * 8 + 3)
#define                                 RXF5SID6_bit        _BIT_ACCESS(RXF5SIDH,3)
// RXF5SIDH<RXF5SID7>
extern volatile __bit                   RXF5SID7            __at(0x78A4);	// @ (0xF14 * 8 + 4)
#define                                 RXF5SID7_bit        _BIT_ACCESS(RXF5SIDH,4)
// RXF5SIDH<RXF5SID8>
extern volatile __bit                   RXF5SID8            __at(0x78A5);	// @ (0xF14 * 8 + 5)
#define                                 RXF5SID8_bit        _BIT_ACCESS(RXF5SIDH,5)
// RXF5SIDH<RXF5SID9>
extern volatile __bit                   RXF5SID9            __at(0x78A6);	// @ (0xF14 * 8 + 6)
#define                                 RXF5SID9_bit        _BIT_ACCESS(RXF5SIDH,6)
// RXF6EIDL<RXF6EID0>
extern volatile __bit                   RXF6EID0            __at(0x6B18);	// @ (0xD63 * 8 + 0)
#define                                 RXF6EID0_bit        _BIT_ACCESS(RXF6EIDL,0)
// RXF6EIDL<RXF6EID1>
extern volatile __bit                   RXF6EID1            __at(0x6B19);	// @ (0xD63 * 8 + 1)
#define                                 RXF6EID1_bit        _BIT_ACCESS(RXF6EIDL,1)
// RXF6EIDH<RXF6EID10>
extern volatile __bit                   RXF6EID10           __at(0x6B12);	// @ (0xD62 * 8 + 2)
#define                                 RXF6EID10_bit       _BIT_ACCESS(RXF6EIDH,2)
// RXF6EIDH<RXF6EID11>
extern volatile __bit                   RXF6EID11           __at(0x6B13);	// @ (0xD62 * 8 + 3)
#define                                 RXF6EID11_bit       _BIT_ACCESS(RXF6EIDH,3)
// RXF6EIDH<RXF6EID12>
extern volatile __bit                   RXF6EID12           __at(0x6B14);	// @ (0xD62 * 8 + 4)
#define                                 RXF6EID12_bit       _BIT_ACCESS(RXF6EIDH,4)
// RXF6EIDH<RXF6EID13>
extern volatile __bit                   RXF6EID13           __at(0x6B15);	// @ (0xD62 * 8 + 5)
