MikroElektronika/core_packages/PIC/XC8/def/PIC18F8585/mcu.h
#define                                 TXB2D05_bit         _BIT_ACCESS(TXB2D0,5)
// TXB2D0<TXB2D06>
extern volatile __bit                   TXB2D06             __at(0x7936);	// @ (0xF26 * 8 + 6)
#define                                 TXB2D06_bit         _BIT_ACCESS(TXB2D0,6)
// TXB2D0<TXB2D07>
extern volatile __bit                   TXB2D07             __at(0x7937);	// @ (0xF26 * 8 + 7)
#define                                 TXB2D07_bit         _BIT_ACCESS(TXB2D0,7)
// TXB2D1<TXB2D10>
extern volatile __bit                   TXB2D10             __at(0x7938);	// @ (0xF27 * 8 + 0)
#define                                 TXB2D10_bit         _BIT_ACCESS(TXB2D1,0)
// TXB2D1<TXB2D11>
extern volatile __bit                   TXB2D11             __at(0x7939);	// @ (0xF27 * 8 + 1)
#define                                 TXB2D11_bit         _BIT_ACCESS(TXB2D1,1)
// TXB2D1<TXB2D12>
extern volatile __bit                   TXB2D12             __at(0x793A);	// @ (0xF27 * 8 + 2)
#define                                 TXB2D12_bit         _BIT_ACCESS(TXB2D1,2)
// TXB2D1<TXB2D13>
extern volatile __bit                   TXB2D13             __at(0x793B);	// @ (0xF27 * 8 + 3)
#define                                 TXB2D13_bit         _BIT_ACCESS(TXB2D1,3)
// TXB2D1<TXB2D14>
extern volatile __bit                   TXB2D14             __at(0x793C);	// @ (0xF27 * 8 + 4)
#define                                 TXB2D14_bit         _BIT_ACCESS(TXB2D1,4)
// TXB2D1<TXB2D15>
extern volatile __bit                   TXB2D15             __at(0x793D);	// @ (0xF27 * 8 + 5)
#define                                 TXB2D15_bit         _BIT_ACCESS(TXB2D1,5)
// TXB2D1<TXB2D16>
extern volatile __bit                   TXB2D16             __at(0x793E);	// @ (0xF27 * 8 + 6)
#define                                 TXB2D16_bit         _BIT_ACCESS(TXB2D1,6)
// TXB2D1<TXB2D17>
extern volatile __bit                   TXB2D17             __at(0x793F);	// @ (0xF27 * 8 + 7)
#define                                 TXB2D17_bit         _BIT_ACCESS(TXB2D1,7)
// TXB2D2<TXB2D20>
extern volatile __bit                   TXB2D20             __at(0x7940);	// @ (0xF28 * 8 + 0)
#define                                 TXB2D20_bit         _BIT_ACCESS(TXB2D2,0)
// TXB2D2<TXB2D21>
extern volatile __bit                   TXB2D21             __at(0x7941);	// @ (0xF28 * 8 + 1)
#define                                 TXB2D21_bit         _BIT_ACCESS(TXB2D2,1)
// TXB2D2<TXB2D22>
extern volatile __bit                   TXB2D22             __at(0x7942);	// @ (0xF28 * 8 + 2)
#define                                 TXB2D22_bit         _BIT_ACCESS(TXB2D2,2)
// TXB2D2<TXB2D23>
extern volatile __bit                   TXB2D23             __at(0x7943);	// @ (0xF28 * 8 + 3)
#define                                 TXB2D23_bit         _BIT_ACCESS(TXB2D2,3)
// TXB2D2<TXB2D24>
extern volatile __bit                   TXB2D24             __at(0x7944);	// @ (0xF28 * 8 + 4)
#define                                 TXB2D24_bit         _BIT_ACCESS(TXB2D2,4)
// TXB2D2<TXB2D25>
extern volatile __bit                   TXB2D25             __at(0x7945);	// @ (0xF28 * 8 + 5)
#define                                 TXB2D25_bit         _BIT_ACCESS(TXB2D2,5)
// TXB2D2<TXB2D26>
extern volatile __bit                   TXB2D26             __at(0x7946);	// @ (0xF28 * 8 + 6)
#define                                 TXB2D26_bit         _BIT_ACCESS(TXB2D2,6)
// TXB2D2<TXB2D27>
extern volatile __bit                   TXB2D27             __at(0x7947);	// @ (0xF28 * 8 + 7)
#define                                 TXB2D27_bit         _BIT_ACCESS(TXB2D2,7)
// TXB2D3<TXB2D30>
extern volatile __bit                   TXB2D30             __at(0x7948);	// @ (0xF29 * 8 + 0)
#define                                 TXB2D30_bit         _BIT_ACCESS(TXB2D3,0)
// TXB2D3<TXB2D31>
extern volatile __bit                   TXB2D31             __at(0x7949);	// @ (0xF29 * 8 + 1)
#define                                 TXB2D31_bit         _BIT_ACCESS(TXB2D3,1)
// TXB2D3<TXB2D32>
extern volatile __bit                   TXB2D32             __at(0x794A);	// @ (0xF29 * 8 + 2)
#define                                 TXB2D32_bit         _BIT_ACCESS(TXB2D3,2)
// TXB2D3<TXB2D33>
extern volatile __bit                   TXB2D33             __at(0x794B);	// @ (0xF29 * 8 + 3)
#define                                 TXB2D33_bit         _BIT_ACCESS(TXB2D3,3)
// TXB2D3<TXB2D34>
extern volatile __bit                   TXB2D34             __at(0x794C);	// @ (0xF29 * 8 + 4)
#define                                 TXB2D34_bit         _BIT_ACCESS(TXB2D3,4)
// TXB2D3<TXB2D35>
extern volatile __bit                   TXB2D35             __at(0x794D);	// @ (0xF29 * 8 + 5)
#define                                 TXB2D35_bit         _BIT_ACCESS(TXB2D3,5)
// TXB2D3<TXB2D36>
extern volatile __bit                   TXB2D36             __at(0x794E);	// @ (0xF29 * 8 + 6)
#define                                 TXB2D36_bit         _BIT_ACCESS(TXB2D3,6)
// TXB2D3<TXB2D37>
extern volatile __bit                   TXB2D37             __at(0x794F);	// @ (0xF29 * 8 + 7)
#define                                 TXB2D37_bit         _BIT_ACCESS(TXB2D3,7)
// TXB2D4<TXB2D40>
extern volatile __bit                   TXB2D40             __at(0x7950);	// @ (0xF2A * 8 + 0)
#define                                 TXB2D40_bit         _BIT_ACCESS(TXB2D4,0)
// TXB2D4<TXB2D41>
extern volatile __bit                   TXB2D41             __at(0x7951);	// @ (0xF2A * 8 + 1)
#define                                 TXB2D41_bit         _BIT_ACCESS(TXB2D4,1)
// TXB2D4<TXB2D42>
extern volatile __bit                   TXB2D42             __at(0x7952);	// @ (0xF2A * 8 + 2)
#define                                 TXB2D42_bit         _BIT_ACCESS(TXB2D4,2)
// TXB2D4<TXB2D43>
extern volatile __bit                   TXB2D43             __at(0x7953);	// @ (0xF2A * 8 + 3)
#define                                 TXB2D43_bit         _BIT_ACCESS(TXB2D4,3)
// TXB2D4<TXB2D44>
extern volatile __bit                   TXB2D44             __at(0x7954);	// @ (0xF2A * 8 + 4)
#define                                 TXB2D44_bit         _BIT_ACCESS(TXB2D4,4)
// TXB2D4<TXB2D45>
extern volatile __bit                   TXB2D45             __at(0x7955);	// @ (0xF2A * 8 + 5)
#define                                 TXB2D45_bit         _BIT_ACCESS(TXB2D4,5)
// TXB2D4<TXB2D46>
extern volatile __bit                   TXB2D46             __at(0x7956);	// @ (0xF2A * 8 + 6)
#define                                 TXB2D46_bit         _BIT_ACCESS(TXB2D4,6)
// TXB2D4<TXB2D47>
extern volatile __bit                   TXB2D47             __at(0x7957);	// @ (0xF2A * 8 + 7)
#define                                 TXB2D47_bit         _BIT_ACCESS(TXB2D4,7)
// TXB2D5<TXB2D50>
extern volatile __bit                   TXB2D50             __at(0x7958);	// @ (0xF2B * 8 + 0)
#define                                 TXB2D50_bit         _BIT_ACCESS(TXB2D5,0)
// TXB2D5<TXB2D51>
extern volatile __bit                   TXB2D51             __at(0x7959);	// @ (0xF2B * 8 + 1)
#define                                 TXB2D51_bit         _BIT_ACCESS(TXB2D5,1)
// TXB2D5<TXB2D52>
extern volatile __bit                   TXB2D52             __at(0x795A);	// @ (0xF2B * 8 + 2)
#define                                 TXB2D52_bit         _BIT_ACCESS(TXB2D5,2)
// TXB2D5<TXB2D53>
extern volatile __bit                   TXB2D53             __at(0x795B);	// @ (0xF2B * 8 + 3)
#define                                 TXB2D53_bit         _BIT_ACCESS(TXB2D5,3)
// TXB2D5<TXB2D54>
extern volatile __bit                   TXB2D54             __at(0x795C);	// @ (0xF2B * 8 + 4)
#define                                 TXB2D54_bit         _BIT_ACCESS(TXB2D5,4)
// TXB2D5<TXB2D55>
extern volatile __bit                   TXB2D55             __at(0x795D);	// @ (0xF2B * 8 + 5)
#define                                 TXB2D55_bit         _BIT_ACCESS(TXB2D5,5)
// TXB2D5<TXB2D56>
extern volatile __bit                   TXB2D56             __at(0x795E);	// @ (0xF2B * 8 + 6)
#define                                 TXB2D56_bit         _BIT_ACCESS(TXB2D5,6)
// TXB2D5<TXB2D57>
extern volatile __bit                   TXB2D57             __at(0x795F);	// @ (0xF2B * 8 + 7)
#define                                 TXB2D57_bit         _BIT_ACCESS(TXB2D5,7)
// TXB2D6<TXB2D60>
extern volatile __bit                   TXB2D60             __at(0x7960);	// @ (0xF2C * 8 + 0)
#define                                 TXB2D60_bit         _BIT_ACCESS(TXB2D6,0)
// TXB2D6<TXB2D61>
extern volatile __bit                   TXB2D61             __at(0x7961);	// @ (0xF2C * 8 + 1)
#define                                 TXB2D61_bit         _BIT_ACCESS(TXB2D6,1)
// TXB2D6<TXB2D62>
extern volatile __bit                   TXB2D62             __at(0x7962);	// @ (0xF2C * 8 + 2)
#define                                 TXB2D62_bit         _BIT_ACCESS(TXB2D6,2)
// TXB2D6<TXB2D63>
extern volatile __bit                   TXB2D63             __at(0x7963);	// @ (0xF2C * 8 + 3)
#define                                 TXB2D63_bit         _BIT_ACCESS(TXB2D6,3)
// TXB2D6<TXB2D64>
extern volatile __bit                   TXB2D64             __at(0x7964);	// @ (0xF2C * 8 + 4)
#define                                 TXB2D64_bit         _BIT_ACCESS(TXB2D6,4)
// TXB2D6<TXB2D65>
extern volatile __bit                   TXB2D65             __at(0x7965);	// @ (0xF2C * 8 + 5)
#define                                 TXB2D65_bit         _BIT_ACCESS(TXB2D6,5)
// TXB2D6<TXB2D66>
extern volatile __bit                   TXB2D66             __at(0x7966);	// @ (0xF2C * 8 + 6)
#define                                 TXB2D66_bit         _BIT_ACCESS(TXB2D6,6)
// TXB2D6<TXB2D67>
extern volatile __bit                   TXB2D67             __at(0x7967);	// @ (0xF2C * 8 + 7)
#define                                 TXB2D67_bit         _BIT_ACCESS(TXB2D6,7)
// TXB2D7<TXB2D70>
extern volatile __bit                   TXB2D70             __at(0x7968);	// @ (0xF2D * 8 + 0)
#define                                 TXB2D70_bit         _BIT_ACCESS(TXB2D7,0)
// TXB2D7<TXB2D71>
extern volatile __bit                   TXB2D71             __at(0x7969);	// @ (0xF2D * 8 + 1)
#define                                 TXB2D71_bit         _BIT_ACCESS(TXB2D7,1)
// TXB2D7<TXB2D72>
extern volatile __bit                   TXB2D72             __at(0x796A);	// @ (0xF2D * 8 + 2)
#define                                 TXB2D72_bit         _BIT_ACCESS(TXB2D7,2)
// TXB2D7<TXB2D73>
extern volatile __bit                   TXB2D73             __at(0x796B);	// @ (0xF2D * 8 + 3)
#define                                 TXB2D73_bit         _BIT_ACCESS(TXB2D7,3)
// TXB2D7<TXB2D74>
extern volatile __bit                   TXB2D74             __at(0x796C);	// @ (0xF2D * 8 + 4)
#define                                 TXB2D74_bit         _BIT_ACCESS(TXB2D7,4)
// TXB2D7<TXB2D75>
extern volatile __bit                   TXB2D75             __at(0x796D);	// @ (0xF2D * 8 + 5)
#define                                 TXB2D75_bit         _BIT_ACCESS(TXB2D7,5)
// TXB2D7<TXB2D76>
extern volatile __bit                   TXB2D76             __at(0x796E);	// @ (0xF2D * 8 + 6)
#define                                 TXB2D76_bit         _BIT_ACCESS(TXB2D7,6)
// TXB2D7<TXB2D77>
extern volatile __bit                   TXB2D77             __at(0x796F);	// @ (0xF2D * 8 + 7)
#define                                 TXB2D77_bit         _BIT_ACCESS(TXB2D7,7)
// TXB2DLC<TXB2DLC0>
extern volatile __bit                   TXB2DLC0            __at(0x7928);	// @ (0xF25 * 8 + 0)
#define                                 TXB2DLC0_bit        _BIT_ACCESS(TXB2DLC,0)
// TXB2DLC<TXB2DLC1>
extern volatile __bit                   TXB2DLC1            __at(0x7929);	// @ (0xF25 * 8 + 1)
#define                                 TXB2DLC1_bit        _BIT_ACCESS(TXB2DLC,1)
// TXB2DLC<TXB2DLC2>
extern volatile __bit                   TXB2DLC2            __at(0x792A);	// @ (0xF25 * 8 + 2)
#define                                 TXB2DLC2_bit        _BIT_ACCESS(TXB2DLC,2)
// TXB2DLC<TXB2DLC3>
extern volatile __bit                   TXB2DLC3            __at(0x792B);	// @ (0xF25 * 8 + 3)
#define                                 TXB2DLC3_bit        _BIT_ACCESS(TXB2DLC,3)
// TXB2EIDL<TXB2EID0>
extern volatile __bit                   TXB2EID0            __at(0x7920);	// @ (0xF24 * 8 + 0)
#define                                 TXB2EID0_bit        _BIT_ACCESS(TXB2EIDL,0)
// TXB2EIDL<TXB2EID1>
extern volatile __bit                   TXB2EID1            __at(0x7921);	// @ (0xF24 * 8 + 1)
#define                                 TXB2EID1_bit        _BIT_ACCESS(TXB2EIDL,1)
// TXB2EIDH<TXB2EID10>
extern volatile __bit                   TXB2EID10           __at(0x791A);	// @ (0xF23 * 8 + 2)
#define                                 TXB2EID10_bit       _BIT_ACCESS(TXB2EIDH,2)
// TXB2EIDH<TXB2EID11>
extern volatile __bit                   TXB2EID11           __at(0x791B);	// @ (0xF23 * 8 + 3)
#define                                 TXB2EID11_bit       _BIT_ACCESS(TXB2EIDH,3)
// TXB2EIDH<TXB2EID12>
extern volatile __bit                   TXB2EID12           __at(0x791C);	// @ (0xF23 * 8 + 4)
#define                                 TXB2EID12_bit       _BIT_ACCESS(TXB2EIDH,4)
// TXB2EIDH<TXB2EID13>
extern volatile __bit                   TXB2EID13           __at(0x791D);	// @ (0xF23 * 8 + 5)
#define                                 TXB2EID13_bit       _BIT_ACCESS(TXB2EIDH,5)
// TXB2EIDH<TXB2EID14>
extern volatile __bit                   TXB2EID14           __at(0x791E);	// @ (0xF23 * 8 + 6)
#define                                 TXB2EID14_bit       _BIT_ACCESS(TXB2EIDH,6)
// TXB2EIDH<TXB2EID15>
extern volatile __bit                   TXB2EID15           __at(0x791F);	// @ (0xF23 * 8 + 7)
#define                                 TXB2EID15_bit       _BIT_ACCESS(TXB2EIDH,7)
// TXB2SIDL<TXB2EID16>
extern volatile __bit                   TXB2EID16           __at(0x7910);	// @ (0xF22 * 8 + 0)
#define                                 TXB2EID16_bit       _BIT_ACCESS(TXB2SIDL,0)
// TXB2SIDL<TXB2EID17>
extern volatile __bit                   TXB2EID17           __at(0x7911);	// @ (0xF22 * 8 + 1)
#define                                 TXB2EID17_bit       _BIT_ACCESS(TXB2SIDL,1)
// TXB2EIDL<TXB2EID2>
extern volatile __bit                   TXB2EID2            __at(0x7922);	// @ (0xF24 * 8 + 2)
#define                                 TXB2EID2_bit        _BIT_ACCESS(TXB2EIDL,2)
// TXB2EIDL<TXB2EID3>
extern volatile __bit                   TXB2EID3            __at(0x7923);	// @ (0xF24 * 8 + 3)
#define                                 TXB2EID3_bit        _BIT_ACCESS(TXB2EIDL,3)
// TXB2EIDL<TXB2EID4>
extern volatile __bit                   TXB2EID4            __at(0x7924);	// @ (0xF24 * 8 + 4)
#define                                 TXB2EID4_bit        _BIT_ACCESS(TXB2EIDL,4)
// TXB2EIDL<TXB2EID5>
extern volatile __bit                   TXB2EID5            __at(0x7925);	// @ (0xF24 * 8 + 5)
#define                                 TXB2EID5_bit        _BIT_ACCESS(TXB2EIDL,5)
// TXB2EIDL<TXB2EID6>
extern volatile __bit                   TXB2EID6            __at(0x7926);	// @ (0xF24 * 8 + 6)
#define                                 TXB2EID6_bit        _BIT_ACCESS(TXB2EIDL,6)
// TXB2EIDL<TXB2EID7>
extern volatile __bit                   TXB2EID7            __at(0x7927);	// @ (0xF24 * 8 + 7)
#define                                 TXB2EID7_bit        _BIT_ACCESS(TXB2EIDL,7)
// TXB2EIDH<TXB2EID8>
extern volatile __bit                   TXB2EID8            __at(0x7918);	// @ (0xF23 * 8 + 0)
#define                                 TXB2EID8_bit        _BIT_ACCESS(TXB2EIDH,0)
// TXB2EIDH<TXB2EID9>
extern volatile __bit                   TXB2EID9            __at(0x7919);	// @ (0xF23 * 8 + 1)
#define                                 TXB2EID9_bit        _BIT_ACCESS(TXB2EIDH,1)
// TXB2CON<TXB2ERR>
extern volatile __bit                   TXB2ERR             __at(0x7904);	// @ (0xF20 * 8 + 4)
#define                                 TXB2ERR_bit         _BIT_ACCESS(TXB2CON,4)
// TXB2SIDL<TXB2EXIDE>
extern volatile __bit                   TXB2EXIDE           __at(0x7913);	// @ (0xF22 * 8 + 3)
#define                                 TXB2EXIDE_bit       _BIT_ACCESS(TXB2SIDL,3)
// PIE3<TXB2IE>
extern volatile __bit _DEPRECATED       TXB2IE              __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TXB2IE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TXB2IF>
extern volatile __bit                   TXB2IF              __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 TXB2IF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TXB2IP>
extern volatile __bit                   TXB2IP              __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 TXB2IP_bit          _BIT_ACCESS(IPR3,4)
// TXB2CON<TXB2LARB>
extern volatile __bit                   TXB2LARB            __at(0x7905);	// @ (0xF20 * 8 + 5)
#define                                 TXB2LARB_bit        _BIT_ACCESS(TXB2CON,5)
// TXB2CON<TXB2PRI0>
extern volatile __bit                   TXB2PRI0            __at(0x7900);	// @ (0xF20 * 8 + 0)
#define                                 TXB2PRI0_bit        _BIT_ACCESS(TXB2CON,0)
// TXB2CON<TXB2PRI1>
extern volatile __bit                   TXB2PRI1            __at(0x7901);	// @ (0xF20 * 8 + 1)
#define                                 TXB2PRI1_bit        _BIT_ACCESS(TXB2CON,1)
// TXB2CON<TXB2REQ>
extern volatile __bit                   TXB2REQ             __at(0x7903);	// @ (0xF20 * 8 + 3)
#define                                 TXB2REQ_bit         _BIT_ACCESS(TXB2CON,3)
// TXB2DLC<TXB2RTR>
extern volatile __bit                   TXB2RTR             __at(0x792E);	// @ (0xF25 * 8 + 6)
#define                                 TXB2RTR_bit         _BIT_ACCESS(TXB2DLC,6)
// TXB2SIDL<TXB2SID0>
extern volatile __bit                   TXB2SID0            __at(0x7915);	// @ (0xF22 * 8 + 5)
#define                                 TXB2SID0_bit        _BIT_ACCESS(TXB2SIDL,5)
// TXB2SIDL<TXB2SID1>
extern volatile __bit                   TXB2SID1            __at(0x7916);	// @ (0xF22 * 8 + 6)
#define                                 TXB2SID1_bit        _BIT_ACCESS(TXB2SIDL,6)
// TXB2SIDH<TXB2SID10>
extern volatile __bit                   TXB2SID10           __at(0x790F);	// @ (0xF21 * 8 + 7)
#define                                 TXB2SID10_bit       _BIT_ACCESS(TXB2SIDH,7)
// TXB2SIDL<TXB2SID2>
extern volatile __bit                   TXB2SID2            __at(0x7917);	// @ (0xF22 * 8 + 7)
#define                                 TXB2SID2_bit        _BIT_ACCESS(TXB2SIDL,7)
// TXB2SIDH<TXB2SID3>
extern volatile __bit                   TXB2SID3            __at(0x7908);	// @ (0xF21 * 8 + 0)
#define                                 TXB2SID3_bit        _BIT_ACCESS(TXB2SIDH,0)
// TXB2SIDH<TXB2SID4>
extern volatile __bit                   TXB2SID4            __at(0x7909);	// @ (0xF21 * 8 + 1)
#define                                 TXB2SID4_bit        _BIT_ACCESS(TXB2SIDH,1)
// TXB2SIDH<TXB2SID5>
extern volatile __bit                   TXB2SID5            __at(0x790A);	// @ (0xF21 * 8 + 2)
#define                                 TXB2SID5_bit        _BIT_ACCESS(TXB2SIDH,2)
// TXB2SIDH<TXB2SID6>
extern volatile __bit                   TXB2SID6            __at(0x790B);	// @ (0xF21 * 8 + 3)
#define                                 TXB2SID6_bit        _BIT_ACCESS(TXB2SIDH,3)
// TXB2SIDH<TXB2SID7>
extern volatile __bit                   TXB2SID7            __at(0x790C);	// @ (0xF21 * 8 + 4)
#define                                 TXB2SID7_bit        _BIT_ACCESS(TXB2SIDH,4)
// TXB2SIDH<TXB2SID8>
extern volatile __bit                   TXB2SID8            __at(0x790D);	// @ (0xF21 * 8 + 5)
#define                                 TXB2SID8_bit        _BIT_ACCESS(TXB2SIDH,5)
// TXB2SIDH<TXB2SID9>
extern volatile __bit                   TXB2SID9            __at(0x790E);	// @ (0xF21 * 8 + 6)
#define                                 TXB2SID9_bit        _BIT_ACCESS(TXB2SIDH,6)
// TXB2CON<TXBIFBXB2CON>
extern volatile __bit                   TXBIFBXB2CON        __at(0x7907);	// @ (0xF20 * 8 + 7)
#define                                 TXBIFBXB2CON_bit    _BIT_ACCESS(TXB2CON,7)
// TXB1CON<TXBIFTXB1CON>
extern volatile __bit                   TXBIFTXB1CON        __at(0x7987);	// @ (0xF30 * 8 + 7)
#define                                 TXBIFTXB1CON_bit    _BIT_ACCESS(TXB1CON,7)
// PIE3<TXBNIE>
extern volatile __bit                   TXBNIE              __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TXBNIE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TXBNIF>
extern volatile __bit                   TXBNIF              __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 TXBNIF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TXBNIP>
extern volatile __bit                   TXBNIP              __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 TXBNIP_bit          _BIT_ACCESS(IPR3,4)
// COMSTAT<TXBO>
extern volatile __bit                   TXBO                __at(0x7BA5);	// @ (0xF74 * 8 + 5)
#define                                 TXBO_bit            _BIT_ACCESS(COMSTAT,5)
// COMSTAT<TXBP>
extern volatile __bit                   TXBP                __at(0x7BA4);	// @ (0xF74 * 8 + 4)
#define                                 TXBP_bit            _BIT_ACCESS(COMSTAT,4)
// PIE3<TXBnIE>
extern volatile __bit                   TXBnIE              __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TXBnIE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TXBnIF>
extern volatile __bit                   TXBnIF              __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 TXBnIF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TXBnIP>
extern volatile __bit                   TXBnIP              __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 TXBnIP_bit          _BIT_ACCESS(IPR3,4)
// TXSTA<TXD8>
extern volatile __bit                   TXD8                __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 TXD8_bit            _BIT_ACCESS(TXSTA,0)
// TXSTA<TXEN>
extern volatile __bit                   TXEN                __at(0x7D65);	// @ (0xFAC * 8 + 5)
#define                                 TXEN_bit            _BIT_ACCESS(TXSTA,5)
// TXSTA<TXEN1>
extern volatile __bit                   TXEN1               __at(0x7D65);	// @ (0xFAC * 8 + 5)
#define                                 TXEN1_bit           _BIT_ACCESS(TXSTA,5)
// PIE1<TXIE>
extern volatile __bit                   TXIE                __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 TXIE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<TXIF>
extern volatile __bit                   TXIF                __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 TXIF_bit            _BIT_ACCESS(PIR1,4)
// IPR1<TXIP>
extern volatile __bit                   TXIP                __at(0x7CFC);	// @ (0xF9F * 8 + 4)
#define                                 TXIP_bit            _BIT_ACCESS(IPR1,4)
// COMSTAT<TXWARN>
extern volatile __bit                   TXWARN              __at(0x7BA2);	// @ (0xF74 * 8 + 2)
#define                                 TXWARN_bit          _BIT_ACCESS(COMSTAT,2)
// SSPSTAT<UA>
extern volatile __bit                   UA                  __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 UA_bit              _BIT_ACCESS(SSPSTAT,1)
// PORTJ<UB>
extern volatile __bit                   UB                  __at(0x7C47);	// @ (0xF88 * 8 + 7)
#define                                 UB_bit              _BIT_ACCESS(PORTJ,7)
// PORTA<ULPWUIN>
extern volatile __bit                   ULPWUIN             __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 ULPWUIN_bit         _BIT_ACCESS(PORTA,0)
// ADCON1<VCFG0>
